[
    {
        "Loại bài viết": "News Article",
        "Tiêu đề bài viết": "What Is Blockchain Security: Challenges and Examples",
        "Chuyên mục mà bài viết thuộc về": "Blockchain Security",
        "Hashtag đi kèm": [
            "None"
        ],
        "Tên tác giả nếu có": "Simplilearn",
        "Link bài viết": "https:\/\/www.simplilearn.com\/what-is-blockchain-security-and-its-examples-article",
        "Tóm tắt bài viết (nếu có)": "None",
        "Nội dung chi tiết bài viết": "Everyone is concerned about cybersecurity today, and they should be as cyber-attacks are on the rise. However, it seems that whenever a new IT advance comes along, people ask, “How secure is it?”\nBlockchain is a relatively new technology originally created to support Bitcoin. However, the technology’s popularity has soared, and people are discovering that blockchain has uses that go beyond cryptocurrency. This newfound popularity, naturally, begs the question of blockchain’s safety and integrity.\nThat’s why today we’re investigating blockchain security, what it is and how it works. We’ll also touch upon some current examples of blockchain security in action.\nAfter all, if big companies like IBM, Walmart, and FedEx use blockchain technology, it would be reassuring to know that the security aspect is up to the task.\n\nWhat is Blockchain Security?\nWe begin by reminding ourselves about blockchain itself and what it is. Blockchain is a distributed ledger technology (DLT) designed to engender trust and confidence in an environment. Blockchain is a decentralized ledger system that’s duplicated and distributed across a whole network of computer systems. It allows information access to all designated nodes or members who can record, share, and view encrypted transactional data on their blockchain.\nBlockchain technology gathers and stores information in groups, also referred to as “blocks,” and each block can hold a certain amount of data. When the block reaches capacity, it is chained to the previous full block, creating a chain of data, hence the clever name “blockchain.”\nBlockchain security is a complete risk management system for blockchain networks, incorporating assurance services, cybersecurity frameworks, and best practices to mitigate the risks of fraud and cyber-attacks.\nBlockchain technology's data structures have inherent security qualities because they are based on consensus, cryptography, and decentralization principles. Each new block of information connects to all the previous blocks in a way that it's nearly impossible to tamper with. In addition, all transactions in a block get validated and agreed on by a consensus mechanism (authorized users), guaranteeing that each transaction is true and accurate. Thus, there is no point of failure, and a user can’t change transaction records.\nHowever, blockchain security goes even beyond its inherent security characteristics. Here’s how.\nWhat Are the Types of Blockchain?\nBefore we explain how blockchain provides security, we need to point out several types of blockchains, each with unique challenges.\nPrivate blockchain networks require an invitation. Users must be validated by either the network’s central administrator or starter or by a rule set put in place by the network’s administrator. Businesses that use private blockchains typically set up a permissioned network. Permissioned networks limit who can participate in the network and the types of transactions they can initiate. In any case, participants need either an invitation or permission to join.\nPrivate blockchains typically use a “Proof-of-Authority” (PoA) consensus approach and are often used in internal, business secure environments to handle tasks such as access, authentication, and record keeping. The transaction data is typically kept private.\nPublic blockchains focus on participation and transparency. Transaction consensus is “decentralized,” meaning anyone can participate in validating network transactions, and the software code is open-source and available to the public (e.g., Bitcoin and Ethereum).\nThe main characteristic of public blockchain networks is decentralization through cryptoeconomics, made to ensure cooperation throughout a distributed network. In public blockchains, it means the network has no political center of control, and the software system design has no architectural central point-of-failure.\nHow much of a blockchain is decentralized relies on the design of the consensus algorithm, network governance, ownership of cryptographic “private keys,” and providing economic incentives. Consider, for instance, the concept of “data mining,” where users earn cryptocurrency by validating transactions. This reward gives people the motivation to join the network and participate in validating the transactions.\nGovernance considerations cover who develops the software code, who can work in the consensus mechanism, and who can participate in the communal governance activities that maintain the network. Public blockchain consensus mechanisms are primarily “Proof-of-Work” (PoW) or “Proof-of-Stake” (PoS).\nHowever, as far as access goes, anyone can join and validate transactions, and that's the significant difference between public and private blockchains.\nTypically, when discussing blockchains, public and private blockchains are the only ones mentioned. However, there is a third option: consortium blockchains. Consortium blockchains consist of known participants preapproved by a central authority to participate in the consensus within a blockchain network. This “semi-permissioned” approach allows a network to be distributed or partly decentralized, yet still allowing for a degree of control over it. Incidentally, transaction data in consortium blockchains can be kept private.\nConsortium blockchains can reach consensus via “Proof-of-Work” (PoW), “Proof of Authority (PoA), or “Proof-of-Stake” (PoS). In addition, there are other available methods, such as delegated proof-of-stake.\nConsortium blockchains are best suited for use between known parties, banking, supply chain management, or Internet of Things (IoT) applications.\nBlockchain Security Challenges\nBlockchain isn’t perfect. There are ways that cyber criminals can manipulate blockchain’s vulnerabilities and cause severe damage. Here are four ways that hackers can attack blockchain technology.\nBecome a Software Development Professional\nThe certification helped me with my career. After finishing the course, I was assigned new projects within my organization. My long-term career goal is to become a leader in the new age of tech for the upliftment of the needy. The course will really help me do it.\nMy learning experience was outstanding. Since I am a working professional, I liked the blended learning environment where I could learn at my own pace. The instructor-led live classes were also unique. I learned a lot of things during the course. After the course completion, I could grab a new job.\n6 Blockchain Security Examples\nHere’s a handful of examples of how companies and organizations are conducting blockchain security.\nThis California-based cryptocurrency company is developing a secure, user-friendly cryptocurrency for businesses that cannot afford to implement ledger security measures independently. Mobilecoin’s cryptocurrency replaces third-party transaction vendors, keeping all the transaction data encrypted at both ends. The product works with Facebook Messenger, WhatsApp, and Signal.\nHere’s another California-based cryptocurrency company. Coinbase is an exchange for selling and purchasing digital currency. Running entirely on encryption, Coinbase stores wallets and passwords in a secure database. Employees must undergo a rigorous background check to ensure cryptocurrency safety.\nJ.P. Morgan is the largest and one of the most popular financial institutions in the United States. It has developed an enterprise-focused version of Ethereum called Quorum, using blockchain technology to process private transactions. J.P. Morgan uses smart contracts on their Quorum network to create transparent yet cryptographically assured transactions.\nThis US-based defense contractor is the first company of its kind to implement blockchain security. Lockheed Martin is working with the cybersecurity firm Guardtime Federal to institute blockchain cybersecurity protocols in engineering systems, software development, and supply chain risk management. Lockheed Martin’s goal is to use blockchain to protect every step of its weapon development systems.\nThis California-based tech giant believes that blockchain is ideally suited for the Internet of Things (IoT) because the inherent ledger technology does away with single points of failure and secures vital private data with encryption. This idea is significant since the Internet of Things has been growing steadily. If blockchain technology becomes the preferred IoT network, this will boost blockchain’s visibility and use. Of course, it doesn’t hurt to have a big IoT player in your corner!\nThis Tennessee-based healthcare innovation firm wants to help the healthcare industry to implement blockchain technology. The firm consists of Hashed Collective, Hashed Enterprise, and Hashed Labs, and each entity focuses on different aspects of blockchain. Hashed Health has partnered with many hospitals and healthcare companies to build secure digital blockchain networks dedicated to patient information sharing and confidential internal communication channels.\nDo You Want More In-Depth Knowledge of Blockchain?\nIf you would like to pursue a blockchain-related career or just upskill your current skill set, you should check out Simplilearn’s Professional Certificate Program in Blockchain. The course, carefully curated with IIT Kanpur and designed for all levels of expertise, gives you valuable insights into real-world blockchain applications. The program includes world-class instructions, outcome-centric bootcamps, and hands-on projects and teaches you about Bitcoin, Hyperledger, Ethereum, Ripple, and Multichain blockchain platforms. You will also learn how to set up a private blockchain network using Hyperledger Composer and deploy smart contracts on Ethereum.\nBlockchain developers in the United States earn an annual average of USD 107,112, according to Glassdoor. Additionally, Payscale reports that blockchain developers in India can make a yearly average salary of ₹807,760.\nAlso, blockchain’s increasing popularity means you will find it used more often in web and application development roles, such as Java full stack developers and PGP full stack web developers. So even if you’re not looking for a career change, you can boost your skills and versatility by learning about blockchain.\nWhether you want a new career or just want to learn the latest blockchain technology, Simplilearn has what you need. Check out our courses today!\n",
        "Ngày tạo": "Feb 21, 2023",
        "Nguồn website": "simplilearn.com"
    },
    {
        "Loại bài viết": "News Article",
        "Tiêu đề bài viết": "Blockchain in Education: 8 Examples to Know",
        "Chuyên mục mà bài viết thuộc về": "Blockchain Education",
        "Hashtag đi kèm": [
            "#Blockchain",
            "#Edtech",
            "#Finance"
        ],
        "Tên tác giả nếu có": "Sam Daley",
        "Link bài viết": "https:\/\/builtin.com\/blockchain\/blockchain-education",
        "Tóm tắt bài viết (nếu có)": "None",
        "Nội dung chi tiết bài viết": "Will the future of learning take place on the blockchain? The edtech industry has made great strides in recent years, but there is still a long road ahead.\nThankfully, technologies like blockchain are helping speed up the process. Ledger tech, along with AI, smartphones and tablets, are rapidly replacing bulky desktop computers and antiquated textbooks as the preferred method of teaching — giving the education industry a much-needed upgrade.\n\nHow Is Blockchain in Education Used?\nBlockchain’s immutable ledger technology creates a chronological list of events that have transpired in real time. These academic records are useful for verifying transcripts, diplomas and test scores. In addition, teachers, university administrators and students can use smart contracts to agree on assignment due dates and even deploy student loan payments.\nPlus, it may not be long before academic institutions are able to incentivize students to pay student loans on time and teachers to motivate students by awarding cryptocurrency to those who perform highly or complete a certain major. The gamification aspect of education created by tokenization has been tremendously beneficial.\nAlthough it’s still at an early stage, blockchain has proven to be helpful for increasing transparency, improving accountability and incentivizing student engagement and learning. As a result, educators are relying on the technology to give education a long-awaited overhaul.\nBelow are eight examples of how blockchain is being implemented in education.\n\n8 Blockchain in Education Examples\nBlockchain in Education Examples\nFounded: 2017\nLocation: Fully Remote\nHow it uses blockchain for education: BitDegree combines blockchain ledgers and tokenization on its tech-focused online education platform. The company offers both free and paid online courses on topics like cryptocurrencies, blockchain implementation and gamified coding to help more people learn about DLT and eventually enter a blockchain-oriented career. The platform also incentivizes learning by offering tokenized scholarships for successful course completion or certain achievements.\nRelated ReadingBlockchain for Food: 10 Examples\nFounded: 2016\nLocation: Cambridge, Massachusetts\nHow it uses blockchain for education: Learning Machine (now a part of Hyland) teamed up with the MIT Media Lab to create Blockcerts, an open standard platform for creating, issuing and verifying blockchain-backed certificates. By creating records like academic transcripts and credentials on a blockchain, the company can review the credibility of documents and discover falsified information. Academic achievements — grades, transcripts and even diplomas — can also be stored on a Blockcerts blockchain for immutable insight into past academic history.\nFounded: 2016\nLocation: Fully Remote\nHow it uses blockchain for education: APPII combines blockchain, smart contracts and machine learning to verify the academic credentials of prospective students and professors. Users create a profile and fill out their academic CV, including education history and transcripts. APPII then uses blockchain to verify a user’s background and lock their information into its blockchain.\n\nFounded: 2003\nLocation: Scottsdale, Arizona\nHow it uses blockchain for education: Parchment offers digital credential services to students, academic institutions and employers. K-12 educators use the company’s blockchain to upload any important developmental progress while higher education institutions use the platform to review academic merit, process applications and produce immutable diplomas. Additionally, students have full-time access to all educational information and can easily share academic achievements with future employers.\n\nFounded: 2015\nLocation: Fully Remote\nHow it uses blockchain for education: Sony Global Education, in partnership with IBM, developed a blockchain platform that enables multiple institutions to add individual academic achievements and other pertinent student information on a ledger in order to maintain irrefutable records on students who have transferred or furthered their education. The blockchain helps educational institutions keep a clear digital transcript, ledger of records and payments for each student.\n\nFounded: 2016\nLocation: Fully Remote\nHow it uses blockchain for education: The Disciplina platform uses blockchain to maintain a unified register of academic achievement and qualifications for universities. The company’s decentralized algorithm automatically assigns a score to someone based on their achievements and qualifications. Universities can use those scores to determine individualized learning plans based on what the student has or hasn’t learned.\nRelated ReadingBlockchain and IoT: 8 Examples Making Our Future Smarter\n\nFounded: 2017\nLocation: Fully Remote\nHow it uses blockchain for education: ODEM is a decentralized marketplace for educational products and services that connects educators, students and professionals to relevant courses and resources with blockchain technology. Using smart contracts, professors and students agree on specific courses that will help further students’ education and bolster their professional backgrounds. The ODEM ledger then recognizes each course a student has taken and a professor has taught, which boosts the reputations of both on ODEM’s platform.\n\nFounded: 2014\nLocation: Fully Remote\nHow it uses blockchain for education: The Blockchain Education Network (BEN) is a cohort of students and alumni all over the world focused on blockchain and cryptocurrency initiatives. Started by students at MIT and the University of Michigan, BEN connects over 6,000 members who share blockchain ideas, build prototypes and launch creations.\n",
        "Ngày tạo": "Mar 21, 2023",
        "Nguồn website": "builtin.com"
    },
    {
        "Loại bài viết": "News Article",
        "Tiêu đề bài viết": "Learn About Blockchain Technology Vs Artificial Intelligence",
        "Chuyên mục mà bài viết thuộc về": "Blockchain Technology Vs Artificial Intelligence",
        "Hashtag đi kèm": [
            "None"
        ],
        "Tên tác giả nếu có": "Simplilearn",
        "Link bài viết": "https:\/\/www.simplilearn.com\/blockchain-technology-vs-artificial-intelligence-article?tag=blockchain",
        "Tóm tắt bài viết (nếu có)": "None",
        "Nội dung chi tiết bài viết": "Blockchain is a digital ledger technology that uses a decentralized network of computers to record and verify transactions. It is most commonly associated with the digital currency bitcoin, but it can be used for a wide variety of applications, including smart contracts, supply chain management, and voting systems. The key feature of blockchain technology is that it is a distributed ledger, meaning that there is no central authority or intermediary controlling the system. Instead, transactions are recorded and verified by the network of users, making it a secure and tamper-proof way of storing and sharing data.\nWhat is Artificial Intelligence?\nAI is the simulation of human intelligence in machines that are made to think and act like humans. It involves creating algorithms and computer programs that can execute tasks that usually require human cognition, including visual perception, speech recognition, decision-making, and language translation. Different forms of AI exist, such as machine learning, natural language processing, and computer vision.\nInterlinking of the Blockchain Technology and AI\nBlockchain technology and Artificial Intelligence (AI) are two distinct but complementary fields. Both are considered cutting-edge technologies that have the potential to revolutionize the way we live and work. However, they can also be combined to create powerful new solutions.\nOne way that blockchain and AI can be combined is through the use of smart contracts. Smart contracts are self-executing contracts with the terms of the agreement written directly into code. By using AI to create smart contracts, it is possible to automatically execute the contract when certain conditions are met, such as when a payment is received or when a delivery is made. This can greatly reduce the need for intermediaries and increase the efficiency of business transactions.\nIdeal Model\nWhile blockchain and AI are known to have functioning individually and independently, the two technologies are more intertwined than ever in recent times. One such area where the combination of AI and blockchain would serve as the ideal model is data handling. The combination helps deal with data-related issues by breaking down the data into smaller parts in a blockchain, which is then distributed across the network.\nThis model can solve some of the major issues for businesses from various industries. While AI can enhance the performance, accuracy, and efficiency of the data, blockchain can run computer networks by looking for power and energy.\nBlockchain vs. Artificial Intelligence\nWith major business implications at a phenomenal rate, both AI and blockchain have a promising future and are here to stay. However, when compared, both AI and blockchain have their own differences and complexities. One of the major issues with blockchain is security, while AI poses the issues of trustworthiness. Taking these issues and more, such as privacy, efficiency, and scalability into consideration, these two technologies can fill the gaps they both individually have.\nBecome a Software Development Professional\nHow Do AI and Blockchain Technology Complement Each Other?\nAI and blockchain technology complement each other by allowing for more efficient, secure, and transparent systems. AI algorithms can be used to process and analyze data, automate processes, and create smart contracts, while blockchain technology provides a secure and transparent way to store and manage data, execute automated processes, and record smart contracts.\nTogether, they can enable new use cases such as predictive maintenance, intelligent supply chain management, and decentralized autonomous organizations. Additionally, blockchain can provide a secure and transparent way to manage and protect sensitive data used for AI models, thereby increasing trust in AI-based decisions and predictions. Overall, the combination of AI and blockchain technology can lead to more efficient, secure, and transparent systems.\nUse Cases for Blockchain and AI\nThere are several potential use cases for combining blockchain and AI. Some of them are:\nAdvantages of Combining AI With Blockchain\nCombining AI with blockchain technology has the potential to offer several advantages, which include:\nChallenges to the Adoption of AI-Based Blockchain Solutions\nAdoption of AI-based blockchain solutions, while very advantageous, can pose several challenges as well. These include:\nTrends for Blockchain and AI Combo\nThere are several up-and-coming trends for the combination of blockchain and AI, which are as follows:\nBecome a Software Development Professional\nHow AI and Blockchain Revolutionize How People Do Business\nAI and blockchain technology have the potential to revolutionize how people do business by providing more efficient, secure, and transparent systems. AI can be used to automate processes, make predictions, and optimize decision-making, while blockchain technology can be used to create secure and transparent records of transactions and data.\nTogether, they can enable new use cases such as predictive maintenance, intelligent supply chain management, and decentralized autonomous organizations. Additionally, blockchain can provide a secure and transparent way to manage and protect sensitive data used for AI models, thereby increasing trust in AI-based decisions and predictions. This can lead to improved efficiency, cost savings, and new revenue streams for businesses.\nFurthermore, by providing a secure and transparent way to store and manage data, AI-based blockchain solutions can help businesses meet regulatory compliance and data privacy requirements. Overall, the combination of AI and blockchain technology has the potential to revolutionize how companies operate, by providing more efficient, secure, and transparent systems.\nA Futuristic Approach\nOne of the most useful future implications of combining two agile technologies– artificial intelligence and blockchain– is the creation of decentralized systems that are safe and immutable. With every industry heavily relying on data, AI and blockchain will help with security advancements in terms of data handling.\nOverall, the combination of blockchain and AI has the potential to create new and powerful solutions that can change the way we think about trust, transparency, and efficiency in various industries such as financial services, healthcare, manufacturing, supply chain and logistics.\nConclusion\nHope this article was able to give you a clear understanding about blockchain technology and artificial intelligence. If you are interested in enhancing your Blockchain skills further, we would highly recommend you to check Simplilearn’s Professional Certificate Program in Blockchain. This program in collaboration with IIT Kanpur, can help you hone the right Blockchain skills and make you job-ready in no time.\nIf you have any questions or queries, feel free to post them in the comments section below. Our team will get back to you at the earliest.\nFAQs\nThe big 4 blockchain technologies in the current times include LeewayHertz, Intellectsoft, Blockchain Intelligence Group, and Markovate.\nThere are mainly four types of block technologies, which are public blockchain, private blockchain, consortium blockchain, and hybrid blockchain.\nBlockchain technology has 4 key features, which include public distributed ledger or decentralization, proof of work, hash encryption, and miners. Public distributed ledger helps prevent data tampering, and hash encryption keeps the data in the blocks safe from unauthorized access. Proof of work is key to maintaining transparency, and miners are the people who mine for bitcoins.\nFive of the most popular blockchain platforms are Ethereum, IBM Blockchain, Hyperledger Fabric, and Hyperledger Sawtooth.\n",
        "Ngày tạo": "Jan 20, 2023",
        "Nguồn website": "simplilearn.com"
    },
    {
        "Loại bài viết": "News Article",
        "Tiêu đề bài viết": "What is Ethereum? Explained With Features and Applications",
        "Chuyên mục mà bài viết thuộc về": "Ethereum",
        "Hashtag đi kèm": [
            "None"
        ],
        "Tên tác giả nếu có": "Karin Kelley",
        "Link bài viết": "https:\/\/www.simplilearn.com\/tutorials\/blockchain-tutorial\/what-is-ethereum?tag=Blockchain",
        "Tóm tắt bài viết (nếu có)": "None",
        "Nội dung chi tiết bài viết": "Ethereum is considered by many to be the second most popular cryptocurrency, surpassed now only by Bitcoin. According to The Motley Fool, the Enterprise Ethereum Alliance (EEA) has some big-name founding members, including Microsoft, Intel, and JPMorgan Chase.\n“The adoption of Ethereum by the corporate world,” says CNBC, “means it could eventually be bigger than its early stage rival.” That means it’s time to get to know the Ethereum platform, including its features and applications, and what makes Ethereum different from Bitcoin.\nOur “Ethereum Explained” Ethereum tutorial video lays it all out for you, and here we’ll cover what’s discussed in the video.\n\n\nWhat is Ethereum?\nEthereum is a blockchain-based computing platform that enables developers to build and deploy decentralized applications—meaning not run by a centralized authority. You can create a decentralized application for which the participants of that particular application are the decision-making authority.\nEthereum Features\nThese are Ethereum’s essential features. Before going deep into the Ethereum tutorial, let’s discuss each of these features in more detail.\nEther (ETH) is Ethereum’s cryptocurrency. It is the fuel that runs the network. It is used to pay for the computational resources and the transaction fees for any transaction executed on the Ethereum network. Like Bitcoins, ether is a peer-to-peer currency. Apart from being used to pay for transactions, ether is also used to buy gas, which is used to pay for the computation of any transaction made on the Ethereum network.\nAlso, if you want to deploy a contract on Ethereum, you will need gas, and you would have to pay for that gas in ether. So gas is the execution fee paid by a user for running a transaction in Ethereum. Ether can be utilized for building decentralized applications, building smart contracts, and making regular peer-to-peer payments.\nSmart contracts are revolutionizing how traditional contracts work, which is why you need to use the tutorial to become more familiar with them. A smart contract is a simple computer program that facilitates the exchange of any asset between two parties. It could be money, shares, property, or any other digital asset that you want to exchange. Anyone on the Ethereum network can create these contracts. The contract consists primarily of the terms and conditions mutually agreed on between the parties (peers).\nThe smart contract’s primary feature is that once it is executed, it cannot be altered, and any transaction done on top of a smart contract is registered permanently—it is immutable. So even if you modify the smart contract in the future, the transactions correlated with the original contract will not get altered; you cannot edit them.\nThe verification process for the smart contracts is carried out by anonymous parties in the network without the need for a centralized authority, and that’s what makes any smart contract execution on Ethereum a decentralized execution.\nThe transfer of any asset or currency is done in a transparent and trustworthy manner, and the identities of the two entities are secure on the Ethereum network. Once the transaction is successfully done, the accounts of the sender and receiver are updated accordingly, and in this way, it generates trust between the parties.\n\n\nIn conventional contract systems, you sign an agreement, then you trust and hire a third party for its execution. The problem is that in this type of process, data tampering is possible. With smart contracts, the agreement is coded in a program.\nA centralized authority does not verify the result; it is confirmed by the participants on the Ethereum blockchain-based network. Once a contract is executed, the transaction is registered and cannot be altered or tampered, so it removes the risk of any data manipulation or alteration.\nLet’s take an example in which someone named Zack has given a contract of $500 to someone named Elsa for developing his company’s website. The developers code the agreement of the smart contract using Ethereum’s programming language.\nThe smart contract has all the conditions (requirements) for building the website. Once the code is written, it is uploaded and deployed on the Ethereum Virtual Machine (EVM).\nEVM is a runtime compiler to execute a smart contract. Once the code is deployed on the EVM, every participant on the network has a copy of the contract. When Elsa submits the work on Ethereum for evaluation, each node on the Ethereum network will evaluate and confirm whether the result given by Elsa has been done as per the coding requirements.\nOnce the result is approved and verified, the contract worth $500 will be self-executed, and the payment will be paid to Elsa in ether. Zack’s account will be automatically debited, and Elsa will be credited with $500 in ether.\nThe Ethereum tutorial video includes a demo on the deployment of an Ethereum smart contract.\n\nEVM, as mentioned above in this Ethereum tutorial, is designed to operate as a runtime environment for compiling and deploying Ethereum-based smart contracts. EVM is the engine that understands the language of smart contracts, which are written in the Solidity language for Ethereum. EVM is operated in a sandbox environment—basically, you can deploy your stand-alone environment, which can act as a testing and development environment. You can then test your smart contract (use it) “n” number of times, verify it, and once you are satisfied with the performance and the functionality of the smart contract, you can deploy it on the Ethereum main network.\nAny programming language in the smart contract is compiled into the bytecode, which the EVM understands. This bytecode can be read and executed using the EVM. Solidity is one of the most popular languages for writing a smart contract. Once you write your smart contract in Solidity, that contract gets converted into the bytecode and gets deployed on the EVM, thereby guaranteeing security from cyberattacks.\nSuppose person A wants to pay person B 10 ethers. The transaction will be sent to the EVM using a smart contract for a fund transfer from A to B. To validate the transaction; the Ethereum network will perform the proof-of-work consensus algorithm.\n\n\nThe miner nodes on Ethereum will validate this transaction—whether the identity of A exists or not, and if A has the requested amount to transfer. Once the transaction is confirmed, the ether will be debited from A’s wallet and will be credited to B’s wallet, and during this process, the miners will charge a fee to validate this transaction and will earn a reward.\nAll the nodes on the Ethereum network execute smart contracts using their respective EVMs.\nEvery node in the Ethereum network has:\nThe goal of the miners on the Ethereum network is to validate the blocks. For each block of a transaction, miners use their computational power and resources to get the appropriate hash value by varying the nonce. The miners will vary the nonce and pass it through a hashing algorithm—in Ethereum, it is the Ethash algorithm.\nThis produces a hash value that should be less than the predefined target as per the proof-of-work consensus. If the hash value generated is less than the target value, then the block is considered to be verified, and the miner gets rewarded.\nWhen the proof of work is solved, the result is broadcast and shared with all the other nodes to update their ledger. If other nodes accept the hashed block as valid, then the block gets added to the Ethereum main blockchain, and as a result, the miner receives a reward, which as of today stands at three ethers. Plus, the miner gets the transaction fees that have been generated for verifying the block. All the transactions that are aggregated in the block—the cumulative transaction fees associated with all the transactions are also rewarded to the miner.\nIn Ethereum, a process called proof of stake is also under development. It is an alternative to proof of work and is meant to be a solution to minimize the use of expensive resources spent on mining using proof of work. In proof of stake, the miner—who is the validator—can validate the transactions based on the number of crypto coins he or she holds before actually starting the mining.\nSo, based on the accumulation of crypto coins the miner has beforehand, he or she has a higher probability of mining the block. However, proof of stake is not widely used as of now compared to proof of work.\nJust like we need fuel to run a car, we need gas to run applications on the Ethereum network. To perform any transaction within the Ethereum network, a user must make a payment, in this case paying out ethers, to get a transaction done, and the intermediary monetary value is called gas.\nOn the Ethereum network, gas is a unit that measures the computational power required to run a smart contract or a transaction. So, if you must do a transaction that updates the blockchain, you would have to shell out gas, and that gas costs ethers.\nIn Ethereum, the transaction fees are calculated using a formula (see screenshot below). For every transaction, there is gas and its correlated gas price. The transaction fees equal the amount of gas required to execute a transaction multiplied by the gas price. “Gas limit” refers to the amount of gas used for the computation and the amount of ether a user is required to pay for the gas.\n\nBelow is a screenshot from the Ethereum network showing the transaction cost. You can see for this particular transaction, the gas limit was 21,000, the gas used by the transaction was 21,000, and the gas price was 21 Gwei, which is the lowest denomination of ether. So, 21 Gwei * 21,000 gave the actual transaction fees: 0.000441 ethers, or about 21 cents as of today. As mentioned, the transaction fee goes to the miner, who has validated the transaction.\n\nTo understand the gas limit and price, let’s consider an example using a car. Suppose your vehicle has a mileage of 10 kilometers per liter and petrol costs $1 per liter. Under these parameters, driving a car for 50 kilometers would cost you five liters of petrol, which is worth $5. Similarly, to perform an operation or to run code on Ethereum, you need to obtain a certain amount of gas, like petrol, and the gas has a per-unit price, called gas price.\n\n\nIf the user provides less than the amount of gas to run an operation, then the process will fail, and the user will be given the message “out of gas.” And Gwei, as noted above, is the lowest denomination of ether used for measuring a unit of a gas price.\ne) How is Ethereum Mining Different from Bitcoin Mining?\nBitcoin\nEthereum\nHashing Algorithm\nSHA-256\nEthash\nTime is taken to mine a block\nAn average of 10 minutes\nAn average of 12-15 seconds\nReward\n12.5 BTC\n3 ETH\nUSD - 04\/10\/2019\n1 Bitcoin = 5249.03\n1 Ether = 180.89\nLet’s compare decentralized applications with traditional applications. When you log in to Twitter, for example, a web application gets displayed that is rendered using HTML. The page will call an API to access your data (your information), which is centrally hosted. It’s a simple process: your front end executes the backend API, and the API goes and fetches your data from a centralized database.\n\nIf we transform this application into a decentralized application when you log in, the same web application gets rendered, but it calls a smart contract-based API to fetch the information from the blockchain network. So, the API is replaced by a smart contract interface, and the smart contract will bring the data from the blockchain network, which is its back end.\nThat blockchain network is not a centralized database; it’s a decentralized network in which the participants of the network (the miners) validate (verify) all the transactions that are happening using the smart contract on the blockchain network. So, any transaction or action happening on a Twitter-type application that has now been transformed will be a decentralized transaction.\nA Dapp consists of a backing code that runs on a distributed peer-to-peer network. It is a software designed to work in the Ethereum network without being controlled by a centralized system, as mentioned, and that is the primary difference: it provides direct interaction between the end-users and the decentralized application providers.\nAn application qualifies as a Dapp when it is open-source (its code is on Github), and it uses a public blockchain-based token to run its applications. A token acts as fuel for the decentralized application to run. Dapp allows the back end code and data to be decentralized, and that is the primary architecture of any Dapp.\nA DAO is a digital organization that operates without hierarchical management; it works in a decentralized and democratic fashion. So basically, a DAO is an organization in which the decision-making is not in the hands of a centralized authority but preferably in the hands of certain designated authorities or a group or designated people as a part of an authority. It exists on a blockchain network, where it is governed by the protocols embedded in a smart contract, and thereby, DAOs rely on smart contracts for decision-making—or, we can say, decentralized voting systems—within the organization. So, before any organizational decision can be made, it must go through the voting system, which runs on a decentralized application.\nHere’s how it works. People add funds through the DAO because the DAO requires funding in order to execute and make decisions. Based on that, each member is given a token that represents that person’s percentage of shares in the DAO. Those tokens are used to vote in the DAO, and the proposal status is decided based on the maximum votes. Every decision within the organization must go through this voting process.\n\n\nReal-World Applications of Ethereum\nConclusion\nHead over to our “Ethereum Explained” Ethereum tutorial video to see an in-depth demo on how to deploy an Ethereum smart contract locally, including installing Ganache and Node in a Windows environment.\nAnd if you want to take your career to the next level, what are you waiting for? Sign up for Simplilearn’s Blockchain Basics course or Professional Certificate Program in Blockchain. Remember that blockchain is the underlying technology not just for Ethereum but for Bitcoin and other cryptocurrencies. And according to ZipRecruiter, the average salary for a blockchain developer is a little over $154,000 a year and some salaries are as high as $242,000!\nIf you have any questions or doubts, feel free to post them in the comments below. Our team will get back to you at the earliest.\n",
        "Ngày tạo": "",
        "Nguồn website": "simplilearn.com"
    },
    {
        "Loại bài viết": "News Article",
        "Tiêu đề bài viết": "Use Cases for Blockchain in Supply Chain Management",
        "Chuyên mục mà bài viết thuộc về": "Blockchain In Supply Chain Management",
        "Hashtag đi kèm": [
            "None"
        ],
        "Tên tác giả nếu có": "Stuart Rauch",
        "Link bài viết": "https:\/\/www.simplilearn.com\/use-cases-for-blockchain-in-supply-chain-management-article?tag=blockchain",
        "Tóm tắt bài viết (nếu có)": "None",
        "Nội dung chi tiết bài viết": "Excitement over blockchain technologies in the financial world was already established years ago, but now blockchain is getting its due in other key industries — among them supply chain management (SCM). Companies worldwide that produce products of almost any sort rely on their supply chain networks to source materials and deliver goods quickly. Now, blockchain is improving how companies can better collaborate with their supply partners and track goods more effectively.\n\nBlockchain in Supply Chain Management vs. Financial World\nBlockchain is defined as a distributed, digital ledger that records transactions via a series of blocks. Multiple copies are spread over many computers, also known as nodes. Ledgers and transactions are fundamentally secure because each new block links back to previous blocks in a manner that makes tampering virtually impossible. And because it’s decentralized, the blockchain ledger doesn’t rely on a single entity such as a bank to keep the data safe. Nodes in the blockchain network receive updated versions of the ledger with every new transaction. To falsify, someone would have to tamper with all copies at the same time, which is very hard to do. And blockchain ledgers can be programmed to automatically trigger transactions.\nThere are some key differences in the way blockchain is used in supply chain networks versus financial transactions. In cryptocurrency networks, for example, the primary function of a blockchain is to enable an unlimited number of anonymous parties to conduct transactions privately without a central third-party entity. Conversely for supply chains, it’s about the opposite: it enables a limited number of known parties to protect operations and transactions from outside tampering. Blockchains are helpful in situations where supply chains are extensive and there are many partners and products to track.\nKey Benefits of Blockchain in Supply Chain Management\nSupply chains are all about moving goods and materials to where they need to be, and blockchain improves companies’ ability to trace, record, and certify the relevant information associated with that process. Deloitte recently highlighted several key benefits for blockchain in supply chain management:\nWith blockchain, companies can digitize physical assets and create a reliable, decentralized record of transactions, which makes it easier to track assets from manufacturing to delivery and provides better visibility from end to end.\nBusinesses that produce high-value goods such as pharmaceuticals can reduce the possibility of fraud in their supply chains. By better understanding how vital ingredients move from one subcontractor to the next, they can reduce losses from counterfeit and grey markets and grow trust by consumers that goods are authentic.\n\nBecome a Software Development Professional\nThe certification helped me with my career. After finishing the course, I was assigned new projects within my organization. My long-term career goal is to become a leader in the new age of tech for the upliftment of the needy. The course will really help me do it.\nMy learning experience was outstanding. Since I am a working professional, I liked the blended learning environment where I could learn at my own pace. The instructor-led live classes were also unique. I learned a lot of things during the course. After the course completion, I could grab a new job.\n\nAll parties in a supply chain have access to the same information, reducing communications problems and data transfer errors, and lowering the amount of time spent on validating the data.\nBy enabling a trustworthy audit trail within the supply chain, blockchain streamlines various administrative processes such as compliance and credit checks, thanks to a distributed ledger of all data and activity.\nHow Blockchain Helps the Food Industry\nFood supply chains, especially the distribution of fresh produce, are often vulnerable to costly recalls driven by bacterial outbreaks that can happen to food in transit. Companies are now looking into blockchain as a better way to enhance visibility and traceability of goods throughout the supply chain, resulting in better quality produce. Consumers themselves are demanding better authenticity of the food they eat. According to Nielsen, almost half of all shoppers will pay extra for products with higher quality safety standards. Walmart has been particularly successful with blockchain-driven food supply chain management, improving their ability to track food supplies from farm-to-store operations in near real-time.\nThe wine industry, which is one of the most counterfeited in the food world (nearly 50 percent of all wine that is sold in China is either counterfeit or deceptively labeled), can also benefit. A decentralized, blockchain-based system helps track wine from vineyard to the store, helping to ensure safety and authenticity of wines in the consumer market.\nEnabling Smart Contracts\nProcurement is a key part of any supply chain, and blockchain enables smart contracts, or chunks of code within an individual block in a blockchain, to automate actions when predetermined conditions are met. The procurement owner can define rules for transactions and enforce obligations by participants. Some examples include:\nThe Future Is Bright for Blockchain in Supply Chain Management\nThe use cases for using blockchain in complex supply chain scenarios are growing every day. There will be increased demand for those with blockchain expertise in the real world who can readily build blockchain networks, deploy smart contracts, and ensure the safety and efficiency of their companies’ manufacturing and distribution capabilities.\nIf you want to move your career forward in this exciting field, Simplilearn’s Professional Certificate in Blockchain Program with IIT Kanpur, will provide you with the knowledge you need to succeed. You will gain access to over 70 hours of applied learning, work on hands-on projects in integrated labs, get to take masterclasses from world-renowned faculty at IIT Kanpur, and ultimately gain your professional certificate to show off your new skills and expertise.\nBecome a Software Development Professional\nThe certification helped me with my career. After finishing the course, I was assigned new projects within my organization. My long-term career goal is to become a leader in the new age of tech for the upliftment of the needy. The course will really help me do it.\nMy learning experience was outstanding. Since I am a working professional, I liked the blended learning environment where I could learn at my own pace. The instructor-led live classes were also unique. I learned a lot of things during the course. After the course completion, I could grab a new job.\n",
        "Ngày tạo": "Nov 11, 2021",
        "Nguồn website": "simplilearn.com"
    },
    {
        "Loại bài viết": "News Article",
        "Tiêu đề bài viết": "What Are Utility NFTs?",
        "Chuyên mục mà bài viết thuộc về": "Utility Nft",
        "Hashtag đi kèm": [
            "None"
        ],
        "Tên tác giả nếu có": "Brooke Becher",
        "Link bài viết": "https:\/\/builtin.com\/articles\/utility-nft",
        "Tóm tắt bài viết (nếu có)": "None",
        "Nội dung chi tiết bài viết": "Even though non-fungible tokens, or NFTs, are one-of-a-kind, blockchain-secured tickets to ownership within a digital space, outsiders may still question their lack of “real-world” use.\nThis is where utility NFTs come in. Utility NFTs are digital assets equipped with tangible rewards and direct applications, and they may just reel in the next generation of NFT adoptees.\nWhat Are Utility NFTs?\nUtility NFTs are unique digital assets that offer use cases beyond their valuation, such as rolling membership benefits, access to premium, gated content or exclusive entry to real-world experiences.\n\nWhat Are Utility NFTs?\nUtility NFTs are digital tokens that grant token holders access to exclusive, real-world use cases. These digital assets are a kind of “NFT with benefits” that go one step beyond the average smart-contract token, offering perks ranging from redeemable rewards, memberships, access to events and passive income opportunities.\nWhile regular NFTs carry value in relation to market demand, like fine art, utility NFTs offer immediate and direct value to the buyer upon purchase through immediate access to specified privileges.\nDescribed as a new era for the cryptocurrency cousin — NFT 2.0 — the concept of attaching instant value and practical application to a digital asset developed organically. In fact, many trending utility NFTs are actually converted from original models. The colorful primate palettes of the Bored Ape Yacht Club weren’t designed with utility in mind, but rather acquired real-world use cases with their burgeoning popularity as a status symbol. Special rewards for Bored Ape holders include minting opportunities or passes to social, networking events.\nToken-gating, or locking products, experiences, content and communities behind an NFT, is how Web3 creators are adding value to their work and harnessing the ropes on how it’s distributed while simultaneously building active, loyal and engaged communities.\nTerm to Know: Token-Gating\n\nTypes of Utility NFTs\nAlthough expanding valuable and practical applications to a digital asset is a fairly novel concept, you may be more accustomed to it than you think.\nDigitized movie or concert tickets, for example, function in likeness to utility NFTs. A patron presents their proof of purchase in a digital format, often downloaded nowadays as barcodes and QR codes, which affords them tangible goods, services and entry to live experiences — like that specific seat in a theater or arena, reserved solely for the ticket holder, for a specific show.\nTo further explore utility NFTs in action, here is a glimpse into some of the general categories that have developed so far in the digital-to-physical-world crossover.\nTypes of Utility NFTs\n\nCreators who release a utility NFT series with governing powers hand over the direction of their project or product to a collaborative community operating through a token-based mechanism. Depending on the model, developers may grant NFT owners absolute say over core decisions or limit token holder input to select issues, reflecting a more hybridized trade-off in administration.\nThis concept overlaps a bit with that of decentralized autonomous organizations, or DAOs, which are the peer-to-peer communities governing Web3 platforms. Made up of stakeholders, these groups rely on each other — and smart-contract automation — to contribute in the decision-making processes that develop the future of a protocol. These, too, run on a token economy, more often than not.\n\nExclusive-entry events are a proven marketing concept with a long history of success. Attaching this tried-and-true promotional practice to an NFT adds value through utility, incentivizing an already invested community to buy in for privileged access.\nEvents can be in-person or online, by way of the metaverse, and vary from professional conferences to all-out ragers. Other formations include networking meetups, expert panels, community group calls, gather spaces and webinars.\nTake for example VeeCon, an annual, multi-day festival behind the NFT series VeeFriends, created by Gary “Vee” Vaynerchuk. The festival attracts 10,255 NFT enthusiasts who can access keynote speeches, educational talks, curated vendors, live music performances and Q&A sessions with their NFT’s ticketing utility.\nIn the “Coachella Keys Collection,”organizers of the three-day, two weekend music and arts festival released 10 unique NFTs that grant lifetime, VIP access to the event.\n\nLocking premium-quality content behind an NFT can create a loyal audience while facilitating an exchange of influence. Leaders of projects release content in demand by their audience. Independently, the market value of the NFT will be directly correlated to a brand’s impact.\nThe first band to release an NFT album was radio-rock brothers Kings of Leon with When You See Yourself in March last year, in three versions: A special album package, another with live show perks — such as lifetime front-row access — and a third that unlocks enhanced, audiovisual art. The limited-edition digital widgets redeemed fans physical copies of the record in vinyl or as compact discs, as well as downloadable MP3 tracks.\nNot to be outdone, rap legend and NFT collector Snoop Dogg announced that upon acquisition of Death Row Records, the label that raised him would become the first of its kind, producing artists and releasing music in the metaverse.\nMore on NFTs In MusicHow NFT Music Is Transforming the Recording Industry\n\nToken-gating coupons and deals maintain holders into a cyclical slow-release pattern, with the short bursts of excitement — exclusive access to discounts — keeping them hooked. This approach works best with established name brands. Depending on a creator’s project, offering discounts and promotions, in likeness to a membership loyalty program, might be more pliable than vaulting a steady stream of premium content behind an NFT. Both, however, rely on a subscription-based structure grocery store and coffee shop regulars are already familiar with.\n\nGiven the traceability of an immutable, public ledger, platform creators can measure on-chain data of user activity to architect a reward and incentive system. Rewarding users for accumulating a certain amount of NFTs, long-term holds on prized NFTs, attending virtual events or community engagement with access to metaverse worlds, multiplying governance tokens or limited-time special offers are some ways platforms are using this method.\n\n47 Examples of Utility NFTs\nDivided by category, here are some top performing NFT projects that make for more than just a pretty avatar. Each holds a utility function for its owner, granting rolling benefits of boundless possibility.\n\nWorld of Freight: Hosting a collection of 10,000 NFTs, this play-to-earn racing game wants to build the first NFT-supported supply chain infrastructure and trade finance protocol, Supplain. All NFTs, which feature ground, water air and even space-travel vehicles, passively generate the platform’s native $WOF tokens — used for upgrading vehicles or customization — and double as membership cards.\nFractal: Developed by a Twitch co-founder Justin Kan, Fractal is a Solana-backed gaming marketplace that aims to sprinkle 100,000 digital snowflakes as items across blockchain-based games, equipped with benefits correlated to the game they’re discovered in. Restoring health, special characters or powers and even secret levels are some in-game benefits made possible when collecting Fractal NFTs.\nMetakey: Metakey gives keyholders access to special perks listing game items, avatars, unique outfits, virtual land access, course material, discounts and airdrops across multiple platforms. Keyholders also have a pass to mint their own NFT using the platform.\nNiftyVille: An open-world concept with a player-driven economy stylized as the Grand Theft Auto of the metaverse. While players drive the backcountry in luxury cars, fight other players or run for mayor of their city, they are also earning passive income by owning a business. According to their website, many of the NFTs will be redeemable for their real-world equivalent.\nAxie Infinity: With 2.8 million daily active players, Axie is one of the first games that put play to earn on the map. Here, axolotl-inspired digital pets battle, breed, own land and hunt treasure. To date, there has been $3.6 billion traded on its marketplace, according to the website.\nNeo Tokyo: Crypto Youtuber Alex Becker dropped this NFT collection in 2021 on the Ethereum blockchain, deliberately releasing NFTs through riddles and clues on his social media as a way to fairly vet deeply invested people to an exclusive space. The tokens are divided into four parts — Neo Tokyo Identities, Vault Cards, Item Caches and Land Deeds — with high expectations on what’s to come.\nLoot: Loot is a project centered on 8,000 NFTs that represent a bag of loot fit for a medieval adventurer. Featuring only white strings of text on black backgrounds, each lists a set of randomized gear generated and stored on the blockchain. Stats, images and other functionality are intentionally omitted for players to interpret their character’s purpose and how they want to play the game.\nMORE ON HOW TO MINT YOUR OWN NFT COLLECTIONA Beginner’s Guide to NFT Crypto Art\n\nCloneX: Beginning with sneakers, metaverse brand RTFKT expanded to a full wardrobe of digital streetwear fashion design after a series of successful footwear collaborations caught traction. CloneX is now owned by Nike. The team unveiled its co-branded NFT, featuring the only virtual trainers dawning the swoosh logo, Nike Cryptokicks.\nJigen: Adapting real-world items to the metaverse, Jigen serves as an NFT gateway for fashion and luxury items. The platform’s purpose is to solve glitches on both ends of consumer and company interfaces with blockchain technology. NFTs on the Jigen platform serve as a certificate of authenticity for an item and are backed by the real-world luxury assets they represent, which can be redeemed at any time or held onto for investment purposes.\nArianee: An open-source protocol that aims to augment the ownership of goods, authenticating tangible, luxury items with a digital NFT.\nDematerialised: An experiential marketplace for virtual goods, Dematerialised converges an emerging digital fashion ecosystem with visceral experiences in a Web3 setting, targeting luxury items. Tied to NFTs, it provides a platform for new income streams where users can access, trade, sell and utilize flex-worthy goods.\nPawn Protocol: An open source non-custodial liquidity protocol that acts as a digital pawn shop. Here, users can post their NFTs as collateral for a crypto-denominated loan, allowing peer-to-peer lending and borrowing on the Solana network and facilitating a much-needed credit market to serve the asset class.\n\nAutograph: A Polygon-based NFT collection that combines user sports fandoms with their crypto wallets. Covered by the faces of famous athletes — from Tom Brady and Tiger Woods to Tony Hawk and Simone Biles — the utility of these digital assets give token-holding fans access to their favorite players with meet-ups, individually signed collectibles and unique content.\nNBA Top Shots: Brought to basketball fans by Dapper Labs, this collection of famous NBA and WNBA “moments,” or historic, highlight reel-worthy clips, brings a traditional trading card feel to Web3. Some moments are deemed rarer than others and are minted in packs.\nUFC Strike: Dapper Labs’ sister project to NBA Top Shots features collectable Ultimate Fighter Championship moments as NFTs from memorable match-ups in the octagon.\nSorare: Sorare is an online fantasy sports league platform where NFT holders can buy, sell and manage a virtual team with their digital, minted cards featuring their strongest lineups across soccer, baseball and football.\nLinksDAO: Users can join this Web3 golf and leisure club for roughly $2,500. Members receive exclusive, curated benefits ranging from discounts on gameplay, free monogramming and fitting services to access of an elite, 200-golf-course network spanning 40 countries.\n\nCryptoPunks: Widely recognized as the first NFT project, CryptoPunks is a 10,000-piece randomized character collection on the Ethereum blockchain featuring 24 x 24 pixelated avatars with uniquely eccentric attributes. A Canadian duo of technologists released the series in 2017 from their New York City-based headquarters, Larva Labs.\nBored Ape Yacht Club: Second only to CryptoPunks, the Bored Ape Yacht Club features a 10,000-strong NFT collective of eccentric primate collectibles whose unique code doubles as a pseudonymous mask users tie their Web3 identities to. To date, the project has generated nearly $2.5 billion in sales and continues to innovate the utility space, inviting token holders to private online spaces, exclusive merch and members-only live events.\nDoodles: Launched in the fall of 2021, Doodles is a community-driven collectibles project in vibrant pastels that features art by Scott Martin, better known as Burnt Toast. The collection, chock full of bubblegum and rainbows, is sized at 10,000 pieces.\nCool Cats: There are 9,999 vibrant, blue “cool” cats that make up Cooltopia, the platform’s multi-layered NFT ecosystem. The original character was drawn up by artist Colin “Clon” Egan, self-described as “The Catoonist,” and has since expanded into a gamified NFT experience with access to tokens, community events, collaborations and more.\nWorld of Women: On a mission to correct Web3’s underrepresentation of female artists, the series of collections support and spotlight emerging femme artists around the world. NFT holders own the underlying artwork and intellectual property, get first looks at original monthly art drops from select NFT artists, access to curated pre-sales and minting opportunities for high potential collections. Holders also receive entry to holders-only raffles and discounts and invites to an annual gala as well as other in-person events.\nCryptoCoven: At the intersection of tarot, astrology, witchcraft and medieval fantasy lore is CryptoCoven — an NFT collection created by five friends that caters to women. It has generated over $20 million in sales.\nMORE ON THE NFT AVATARS OF WEB3PFP NFTs: A Beginner’s Guide\n\nUnstoppable Domains: An NFT domain name provider and digital identity platform that generates NFTs for individuals, organizations and companies with personal information attached, like a business card or portfolio. This allows users to be fully connected to their networks while still being able to pocket their accounts in a decentralized wallet. These NFTs simplify crypto transactions with human-readable names and ease website creation and hosting on Web3.\nEthereum Name Service: A blockchain equivalent to the internet naming convention known as Domain Name System — the current, premiere choice for website developers when mapping an IP address to a literate domain name. ENS re-codes strings of gibberish, alphanumeric keys tied to decentralized websites and wallets to legible, easy-to-memorize domain names while maintaining functionality. These NFTs double as a wallet address, a cryptographic hash or a website URL that can store address information and receive any cryptocurrency, token or NFT.\n\nSnapshot: A decentralized, tailor-made voting platform that makes it easier for communities and organizations to create their own proposals. Various voting types and strategies — including NFT voting, tallying votes and eliminating voter fraud by verifying voter data through its smart-contract makeup — are supported. Results are easy to verify and hard to contest. Snapshot’s user-friendly process is performed off of the mainnet in its entirety, forgoing gas fees.\n\nMeebitsDAO: A 20,000 army of three-dimensional, algorithmically-generated voxel characters backed by a decentralized autonomous organization dedicated to funding and developing an ecosystem around the characters. Once a user’s general membership NFT is minted, they have access to the Discord channel and the ability to participate in the project through a DAO governance system.\n\nPleasrDAO: An investor group of decentralized finance, or DeFi, natives, NFT collectors and digital artists that team together to acquire and share ownership of high-value, culturally significant NFTs, such as the original snap of “Kabosu,” the Shiba Inu face of Doge. By buying in, your contribution not only affords you a slice of internet history but actively benefits an assortment of charities.\nFlamingoDAO: With deep belief in the power of own-able, digital content, Flamingo is one of the most exclusive autonomous organizations, boasting an NFT collection valued at $1 billion, that aims to support, purchase, archive, collect and tokenize important, blockchain-based assets. Their participation in NFT valuation keeps the market relevant and creators in demand. Users buy in at high entry rates, with new members putting down 3,000 ETH or about $8 million. The duality of becoming a FlamingoDAO member offers the “ability to develop and deploy NFT-focused investment strategies,” according to its site.\nVitaDAO: A collective for community-governed and decentralized drug development, VitaDAO group funds and digitizes research in the form of NFTs with built-in intellectual property. These NFTs fund research and development in the longevity space, specialized to extending human life and healthspan.\n\nDNA Test by Nebula Genomics: This project, a partnership between startup Nebula Genomics and Oasis Labs, wants to give users complete control over their genetic sequencing data — packaged in a DNA NFT — to combat consumer test kits that monetize users’ information. Through the function of NFTs, Nebula Genomics protects consumers from selling their genetic information by packaging it as a secure, digital asset they can own themselves.\nMolecule: A platform that connects drug development researchers and investors in an effort to expedite the process of advancing biopharma, treating patients with novel therapeutics that don’t exist yet. Molecule utilizes NFTs by turning the intellectual property of pre-screened projects into IP NFTs, making them liquid, easily investable assets that are transferable.\nGainForest: An international, non-profit based in Switzerland, Gainforest is a decentralized fund using artificial intelligence to measure and reward sustainable nature stewardship to help accelerate conservation efforts. Users who donate to the platform receive “NFTrees” that represent actual rainforest locations, which help owners track the health of the causes they care most about.\n\nRoyal.io: A platform that allows NFT holders to own a piece of their favorite songs, support their favorite artists and passively earn royalties as they build their library. While earning royalties alongside their favorite artists, users will also have access to artists communities and be eligible to receive merch, invites to private listening parties as well as meet-and-greet opportunities.\n\nFlyfish Club: An NFT membership card designed around its utility, the Flyfish Club is Web3’s first private diner’s club that permits unlimited access to a 10,000 square-foot New York City location — consisting of “a cocktail lounge, upscale restaurant, intimate omakase room and an outdoor space” — as well as various culinary, cultural and social experiences.\nCrypto Baristas: Providing the “complete caffeine experience,” each Crypto Baristas NFT comes with caffeinated benefits, including discounts for lifetime at all future cafe locations, award-winning coffee shipped to home, trips and tickets to New York Coffee Fest.\n\nSuperRare: Dubbing itself as a merger of “Instagram meets Christie’s,” SuperRare is a marketplace that features single-edition digital artworks. In terms of utility, artists reap second-market royalties, forever.\nFoundation for Art and Blockchain: An ambitious platform set out to build a new creative economy wielding the power of the blockchain. Aside from providing funds for minting, they host live exhibitions, auctions and galleries, and also educate creatives on how Web3 can work for them.\nNifty Gateway: A marketplace and a custodial platform that acts as a modern art dealer. In comparison to other applications, Nifty Gateway prioritizes quality over quantity, exclusively featuring curated and verified art. It stores NFTs on a platform wallet secured by Gemini’s state-of-the-art custody technology in order to facilitate gasless sales and transfers.\nCoinbase NFT: One of the leading crypto exchanges now has its own marketplace for minting, buying, selling and trading NFTs, boasting the “best prices.”\nMORE ON HOW TO PROTECT YOUR NFT ARTNFT Art Theft: What Buyers and Artists Need to Know\n\nLooksRare: A community-first, decentralized marketplace vying for the top spot of OpenSea, the world’s largest NFT art exchange. Its edge? LooksRare actively rewards traders, token stakers, creators and collectors for platform participation.\n\nChristie’s Encrypted: Launching a fully blockchain-based auction platform — Christie’s 3.0 — the historic auction house reinvented itself as a destination for NFT-based art. Its most famous sale, Beeple’s “Everydays: The First 5000 Days,” sold for a record $69 million in March 2021, instigating a bullish NFT market.\nSotheby’s Metaverse: The online destination for “rare and extraordinary NFTs” is a collaboration between NFT artist Hackatoo, decentralized production company NFT Studios, world broker of fine art and collectibles Sotheby’s, and multinational semiconductor company AMD.\n\nNFTWorlds: Composed of 10,000 unique worlds built on Minecraft open-source software, NFTWorlds is an open-world “multi-metaverse” where players socialize at community hangouts, participate in mini-games and enjoy limitless experiences in the virtual realm while passively generating crypto income.\nThe Sandbox: A decentralized, community-driven gaming ecosystem where creators are encouraged to create, share and monetize their own NFTs. Sandbox landowners purchase plots as an NFT and can host their own experiences. Celebrities and name brands, including Snoop Dogg, Adidas, Paris Hilton and Gucci, have staked out their own digital grounds to build on.\nDecentraland: An Ethereum-powered, browser-based virtual world owned by its users, who buy virtual plots of land in the form of NFTs using the native coin, Mana. Further utility comes in via features such as item generation, where designers can create and sell clothes and accessories for their digital neighbors.\nPavia: The first digital world by blockchain-platform Cardano, Pavia invites landowners, creators and visitors to play-to-earn opportunities and rewards. From trading NFT creations, earning in-game rewards or driving footfall to a plot, players are rewarded in native $PAVIA tokens as well as exclusive NFTs, which unlock VIP access and power-ups for their avatars. In total, the platform hosts 100,000 land parcels.\n",
        "Ngày tạo": "Mar 08, 2023",
        "Nguồn website": "builtin.com"
    },
    {
        "Loại bài viết": "News Article",
        "Tiêu đề bài viết": "DeFi: Your Guide to Decentralized Finance",
        "Chuyên mục mà bài viết thuộc về": "Defi Decentralized Finance",
        "Hashtag đi kèm": [
            "None"
        ],
        "Tên tác giả nếu có": "Brian Nordli",
        "Link bài viết": "https:\/\/builtin.com\/articles\/defi-decentralized-finance",
        "Tóm tắt bài viết (nếu có)": "None",
        "Nội dung chi tiết bài viết": "The first time Erin Holloway encountered the world of decentralized finance, she had the same question as almost everyone else: What exactly is it?\nEven with nearly 20 years of financial experience working for JP Morgan, the industry puzzled her at first and piqued her curiosity. On the one hand, DeFi — as it’s called for short — is a field brimming with promise, envisioning a more egalitarian financial future run on blockchain. In it, anyone — especially those underserved by the banking industry — can take out a loan or invest in a company without going through a financial institution.\nWhat Is DeFi?\nOn the other hand, one of the more popular cryptocurrencies — the blockchain-based digital currency that DeFi depends on — started as a joke (Dogecoin) and there are countless stories of coins that could portend the future or descend into scandal.\nSo, which is it? The reality is somewhere in the middle. It’s still considered the Wild West of technology and finance, but its future potential also can’t be ignored.\n“I did have that healthy sense of skepticism, but at the same time, I could also see what was happening,” said Holloway, who now works for Prime Trust, which provides the financial infrastructure for DeFi applications. “It was a revolution, and there were things about the traditional finance world that needed to change and change for the better.”\n\nWhat Is DeFi?\nFirst, let’s take a step back and define what DeFi means.\nDeFi is a broad term used to describe any blockchain-based application that allows users to process a financial transaction outside of a traditional financial institution. It’s the backbone of Web3, and allows users to take out a digital loan, lend cryptocurrency, buy an NFT, invest in other cryptocurrencies, become a voting member of a decentralized company or dive into one of the many play-to-earn blockchain-based games.\nSince it’s blockchain-based, data is stored across a distributed network of systems, what’s known as a distributed ledger, and can’t be updated, deleted or controlled by a central entity.\n\nTraditionally, any financial transaction you want to complete — from buying a cup of coffee to taking out a loan — has to go through an accredited institution like a bank. They’re there to confirm that your account exists and that you meet the rules necessary to complete the transaction.\nDecentralized finance changes that equation. Instead of banks storing and controlling your funds, you store your digital assets (cryptocurrency, tokens and NFTs) in a crypto wallet, which you have complete control over. This means anyone can open an account and no entity can freeze your funds or charge you for failing to maintain a minimum balance.\nDecentralized apps (known as dApps) built on the blockchain then facilitate peer-to-peer transactions thanks to what’s known as smart contracts, self-executing code that ensures a fair transaction. Smart contracts are the key behind DeFi. Just as the bank needs to verify that your account has the funds necessary to execute a transaction, smart contracts do the same thing.\nIf you wanted to borrow $50 in a token, for example, the smart contract would contain the parameters to receive those funds, setting the interest rate and collateral required to borrow the cryptocurrency. When the code runs, it verifies that those conditions are met and then releases the loan. And once the loan is repaid, the code will execute again and release the collateral assets back to the borrower.\nIn essence, it operates as a third party governing a peer-to-peer transaction, creating trust in the transaction.\n\nIf it feels like DeFi came out of nowhere in 2020, that’s because it sort of did.\nThe basic ingredients of DeFi can be traced back to the foundation of Bitcoin, which was created to facilitate safe, peer-to-peer financial transactions without bank involvement. Its goal was to replace traditional fintech payment systems that connect bank account to bank account to transact, like PayPal or Venmo.\nEthereum, an open-source blockchain platform and the second most popular cryptocurrency, took it a step further, providing the infrastructure for programmable smart contracts. Because of this, most decentralized apps today are built using Ethereum’s software.\nStill, the potential to revolutionize existing financial practices remained largely theoretical as the technology developed, said James Wang, head of tokens for Amun, a DeFi index firm.\n“A few years ago, crypto was really a vigorous debate about what money is and blockchain ... There weren’t any applications that people could use.”\nCryptocurrency previously had to be purchased from digital exchanges that relied on clunky background checks. When those companies got hacked, people’s accounts got exposed, causing them to lose money.\n“A few years ago, crypto was really a vigorous debate about what money is and blockchain,” Wang said. “There weren’t any applications that people could use.”\nThat all changed during what Wang called the “Summer of DeFi” in 2020. Suddenly, DeFi smart contracts went from $700 million to $15 billion, according to cryptocurrency news website Decrypt.\nIn addition, Ethereum-based platforms like Maker, Aave and Compound matured, allowing crypto lending and borrowing to happen on the blockchain at scale, Wang said.\nCryptocurrencies gain value the more people adopt it because there is a limited supply. Coins that are more useful, meaning they can be exchanged on a wide-variety of dApps, tend to have the most value. As a result, these developments expanded the functionality of crypto and created a booming market around it.\nIt also made conducting a safe, peer-to-peer transaction more accessible to the average person. Similar to how we use our smartphones without needing to know how they work, it became possible for people to buy, sell and trade cryptocurrency without needing to understand the nuances of it, Wang said.\n“All of a sudden, people not interested in crypto or having an opinion on monetary policy could participate,” Wang said. “Crypto really became usable.”\nMore on BlockchainWhen Are Play-to-Earn Games Going to Get Good?\n\nWhat Are the Benefits of DeFi?\nIf DeFi encompasses all the same functionalities as traditional finance, why bother with it?\nFor people with an extensive banking history and strong financial background, DeFi’s primary benefit is as a way to diversify your funds. You can play the cryptocurrency market or participate in decentralized autonomous organizations, or DAOs, which are the community-based governing entities that pool resources together to work toward the success of a project, by purchasing governance tokens. Those tokens are what give you voting power and influence in the community.\nYou can then move your digital assets to other exchanges and crypto platforms without going through a clearing house or other arcane processes as you would for moving your stocks or opening up another bank account, said Eric Chen, founder of Injective Protocol, which provides a platform for users to build dApps.\nMoving credit and assets between platforms is much smoother than traditional finance, Chen added.\nDeFi’s biggest impact, however, lies in the ways it can serve those who the traditional financial institutions overlook, according to Merav Ozair, a fintech professor at Rutgers University’ business school and blockchain technology expert.\nFor starters, decentralized apps give users complete control over their funds. Traditional financial institutions can freeze your account, preventing you from making any withdrawals or sending preauthorized payments (like your scheduled rent bill payment). They also require multiple forms of identification, credit scores and other documents to get started for some services.\nDecentralized finance apps require no such things and don’t have the power to touch your funds. They also lower the barrier for services like loaning money.\n“[DeFi] opened the doors and [does] not limit the unbanked and underbanked from having a means of transacting.”\nEarlier in Holloway’s career at JPMorgan, she was the banker who’d accept or reject people for loans. She’d analyze their financial statements, review their credit scores and calculate their risks before approving the funds. It’s a process meant to protect banks from undue risk, but it can also leave out the people who most need the loans.\n“I used to be the banker who told people ‘no.’ The banks consider you a low credit risk because you have collateral, and you’re high credit risk [if you don’t] ... It’s counterintuitive,” Holloway said. “[DeFi] opened the doors and [does] not limit the unbanked and underbanked from having a means of transacting.”\nDeFi transactions don’t care about your financial history, Holloway said. All that matters is that you have a smartphone and the required assets on hand to put up as collateral. Interest rates to pay back that loan also tend to be much lower because there’s no third party involved taking a cut.\nDeFi also makes it easier to transfer large sums of money around the world. If a person wanted to send money to a family member in another country, they’d likely have to send it over the wire, which can take weeks to process, and pay a wire fee. With crypto, the user can send it instantly and pay a flat processing fee, Wang said. “And the user doesn’t need a bank.”\nDeFi, though, isn’t completely frictionless. As of right now, most companies don’t accept crypto as a valid form of payment because of its volatility, which limits its use case to digital transactions with other people who deal in crypto. This makes its main value like that of a stock or asset that you hold onto for its perceived value.\nThat said, users can turn their crypto into fiat currency through decentralized exchanges or get a crypto debit card. The debit card syncs with a crypto wallet and can be used in normal transactions. Some will require the user to load a prepaid amount onto it by exchanging the crypto into cash ahead of time, others will operate like a traditional debit card, pulling the digital funds from your account and doing the exchange when you swipe.\nFor these reasons, Ozair believes DeFi adoption will start in countries without stable financial institutions. In 2021, El Salvador became the first country to accept Bitcoin as legal tender to help the majority of its citizens who don’t have access to traditional financial services. Venezuela also launched a state-backed coin called Petro as an alternative to the highly inflated value of the bolívar. Its success, however, remains limited.\nThe Philippines is fast becoming a hub for crypto adoption and development thanks to a mix of crypto friendly laws and the fact that most citizens aren’t served by traditional financial institutions. Currently, people can purchase bitcoins with cash at more than 3,000 7-Elevens and one in seven people use some form of crypto application, according to crypto publication Cointelegraph Magazine.\nPhilippines-based decentralized apps like PDAX, SendFriend and Coins.ph have grown in popularity because they make it easier for people to pay bills, transfer money and buy goods, and charge a much lower transaction fee than traditional banks, Ozair said.\nMore recently, crypto has become a valuable resource for the Ukrainian government during the war. In 2021, the government began soliciting crypto donations online, and have since used those funds to purchase military gear like bulletproof vests, night-vision goggles and medical supplies. And crypto allowed the government to access the funds faster than cash donations, according to the Center For Strategic and International Studies.\nIt’s not hard to see the promise of DeFi, but it’s also not without its problems.\n\nRisks of DeFi\nOf course, DeFi isn’t perfect. There’s a reason some people think of it as a fad and others are hesitant to dive in.\nThere are the risks associated with being a nascent technology. Since anyone can create a cryptocurrency, it can be difficult to parse through what’s serious and what’s a joke. Meme coins, in particular, are incredibly volatile. Designed after a meme, they’re meant to go viral one day — skyrocketing its value — then disappear the next.\nBitcoin and Ethereum remain the most stable bets, but prices for crypto still fluctuate dramatically as the technology develops. Most recently, Terra’s Luna coin collapsed in value causing the company to hemorrhage billions of dollars and investors to lose money.\nIn addition, DeFi doesn’t offer the same security a financial institution can. Research from blockchain analytics platform Elliptic found that users lost $10.5 billion in thefts and scams over the course of 11 months in 2021. The industry is also rife with phishing scams. Common scandals include phishing attempts that direct users to fake websites where they can enter their credentials, and people posing as crypto wallet help centers on Twitter offering assistance to users in exchange for their private keys, according to Wang.\n“This is one area where the crypto community has to rethink how it [lets] the average person use this stuff and have the equivalent of an undo button to help them overcome personal errors.”\nThen there are rug pulls, or scams in which a person launches a cryptocurrency, builds up the price and then takes off with the money, plummeting the value of the coin to zero.\nUltimately, DeFi’s biggest advantage — providing users with complete control over their funds — is also its biggest risk for the average person, Wang said. With no central authority to turn to for help, once funds leave your account, they’re gone.\n“This is one area where the crypto community has to rethink how it [lets] the average person use this stuff and have the equivalent of an undo button to help them overcome personal errors,” Wang said.\n\nWhat Can You Do in DeFi?\nGetting a crypto wallet and putting some cryptocurrency in it is the simplest step to get involved in DeFi.\nBitcoin is the most popular cryptocurrency, but there are a number of other digital assets that can be bought, sold and traded through DeFi. The most common digital assets fall into a few different categories:\nThere are also several actions that can be completed via DeFi:\nmore on CryptocurrencyCryptocurrency for Change: How Token Economies Are Upending Markets\n\nWill DeFi Catch Up to Traditional Finance Worldwide?\nWill we one day be able to purchase a Coke with Dogecoin and pay college tuition in Shiba Inu? Maybe. (You can buy a Tesla with Dogecoin after all.) And crypto has already become mainstream in some countries like El Salvador and the Philippines.\nBut DeFi still has a long way to go before it can compete with traditional finance.\n“The current infrastructure of decentralized finance has enabled a lot of early discovery and exploration of what’s possible, but we’re still very far from seeing the full potential,” Chen said.\nFor starters, the market is too volatile. If the value of a cryptocurrency can swing from one day to the next, most companies aren’t going to accept it as a main form of currency — aside from outliers like Tesla and SpaceX.\nAnd people are starting to develop a healthy dose of skepticism regarding what coins to invest in after events like the Luna collapse. The dust should eventually settle, and it’ll be clear which coins are here to stay, Holloway said.\nBut there are a couple other advancements that could help DeFi mature. There needs to be more customer protection if DeFi is going to attract more mainstream adoption, Ozair said. She advocates for the development of a DAO that would authorize dApps similar to the way Apple vets applications in its store. Doing so would reduce the number of bad actors trying to scam investors with fake projects.\nIn addition, DeFi lending applications need to be able to assess risk more effectively. Right now, a user might have to put up $100 in Ether to borrow $50 in another coin, which isn’t efficient, Wang said. One solution would be for a program that could link an individual to their other wallets and more properly assess their financial risk. This would allow them to process undercollateralized loans, he said.\nThe most likely future will involve some form of hybrid finances, in which some DeFi services merge with traditional finance. Already, solutions have launched to allow users to place some of their retirement investments into digital currencies and have some of their savings accounts in crypto, according to Wang.\nWhether you think DeFi will ultimately be a fad or you believe in its radical potential, one thing is for certain — it pays to know what it is.\n",
        "Ngày tạo": "Jun. 15, 2022",
        "Nguồn website": "builtin.com"
    },
    {
        "Loại bài viết": "News Article",
        "Tiêu đề bài viết": "Blockchain Voting: The Future of Elections?",
        "Chuyên mục mà bài viết thuộc về": "Blockchain Voting Future Elections",
        "Hashtag đi kèm": [
            "#Blockchain"
        ],
        "Tên tác giả nếu có": "Sam Daley",
        "Link bài viết": "https:\/\/builtin.com\/blockchain\/blockchain-voting-future-elections",
        "Tóm tắt bài viết (nếu có)": "None",
        "Nội dung chi tiết bài viết": "Let’s face it — even as one of the world’s leading democracies, the U.S. population is not always the best at exercising our fundamental right to vote.\nThough the 2020 presidential election boasted the highest U.S. voter turnout of the 21st century, the country still falls behind in turnout in comparison to other developed nations. According to the Council on Foreign Relations, overall turnout in 2020 U.S. national elections lied at 62 percent, falling three percent below the 65 percent average for members of the Organization for Economic Cooperation and Development — meaning that we still have a ways to go to improve our voting participation.\nWhy are Americans not turning up at the polls? Candidate dissatisfaction, electoral process frustration and voter place inaccessibility all play a role.\nOnly one in five Americans are very confident in the country’s election system, as recorded in a poll by ABC News and The Washington Post. Additionally, in a research report on global assessments of the quality of national elections, the Election Integrity Project noted the U.S. as the lowest ranked among liberal democracies. Plus, physically getting to the polls on Election Day is a roadblock for many potential voters.\nIf we want to improve our election process, it’s worth considering how we can use blockchain.\nWhile blockchain voting won’t solve all our problems — and even introduces a few of its own — the promise of the technology to revolutionize the American elections system is intriguing.\n\n\nHow Blockchain Voting Works\nAccording to Washington, D.C. think tank Brookings Institution, blockchain voting, or decentralized voting, has the potential to solve a number of problems like combating voter fraud and ensuring every vote is counted. This would be thanks in part to the nature of blockchain technology and how it stores and transmits information.\nPotential Benefits of Blockchain Voting\nBlockchain works to be inherently secure and ensure original information is unchangeable, providing a single-source-of-truth and acting as a tracking method for any data recorded. When applied to voting, this could mean the opportunity for unaltered votes, voting transparency, increased online accessibility and more organized voting operations.\nHere are a few examples of how blockchain voting technology is playing out in both the private and public sectors.\n\nBlockchain Voting Applications to Know\nLocation: Boston, Massachusetts\nVoatz is a mobile election platform that runs entirely on blockchain. The company’s voting platform uses a three-step voter authentication process, including fingerprint recognition, a live photo and a one-phone, one-vote system.\nOnce a voter has been confirmed eligible by cross-referencing a driver’s license, the voter mark their ballot by distributing tokens to each candidate. The tokens are debited from the voters public ledger and added to the candidates ledger. The candidate with the most tokens wins the election.\nVoatz’s technology has already been used by some absentee and overseas military personnel voters to cast their votes in West Virginia in 2018 and Colorado in 2019.\n\nLocation: Golden, Colorado\nFollow My Vote is an online voting platform using open-source blockchain ballot boxes.\nWith a webcam and valid voting ID, election participants can remotely cast a vote from any mobile device. The company’s software produces a unique ID for each voter that cannot be replicated.\nBecause elections can have last-second developments, Follow My Vote gives voters the ability to go back and change their choice up until the last second of the voting deadline.\nThe company’s reliability on blockchain also allows for participants to see election results in real-time for a more transparent and faster election process.\n\nLocation: Cleveland, Ohio\nVotem is a combined suite of election management solution software built on the company’s blockchain-based CastIron Platform. Votem’s software offers various avenues on desktop and mobile for increasing voter accessibility and saving time in the voting process. Depending on the feature, users are able to register to vote, pre-mark ballots, vote remotely or create complete voting systems all online.\nDuring the 2016 presidential election, Votem was used to facilitate voter registration as well as absentee ballot requests and delivery in Montana and Washington, D.C.\n",
        "Ngày tạo": "Sep 21, 2022",
        "Nguồn website": "builtin.com"
    },
    {
        "Loại bài viết": "News Article",
        "Tiêu đề bài viết": "Blockchain and AI: How They Integrate and 26 Examples",
        "Chuyên mục mà bài viết thuộc về": "Blockchain Ai",
        "Hashtag đi kèm": [
            "#Artificial Intelligence",
            "#Blockchain",
            "#Finance"
        ],
        "Tên tác giả nếu có": "Sam Daley",
        "Link bài viết": "https:\/\/builtin.com\/artificial-intelligence\/blockchain-ai-examples",
        "Tóm tắt bài viết (nếu có)": "None",
        "Nội dung chi tiết bài viết": "Blockchain and artificial intelligence (AI) have evolved into leading technologies that drive innovation across almost every industry — and they’re even more powerful together.\n\nHow Blockchain and AI Work Together\nBlockchain offers a secure and transparent database to store information, while AI can model problem-solving capabilities of the human mind.\nWhen used together, blockchain can improve the trustworthiness of data resources that AI models pull from and increase the speed of AI operations by connecting models to automated smart contracts.\nHow Do Blockchain and AI Work Together?\nBlockchain and AI combined can improve operational efficiency, information accuracy and data security.\n\nUse Cases for Blockchain and AI\nCombining blockchain and AI can help build and organize immense databases, strengthen cybersecurity protocols and perform tasks in a fraction of the time it takes humans.\nAs a result, we may see improved healthcare recommendations, optimized food traceability in the supply chain and up-to-date market predictions for real estate or stocks.\nAnd that’s just a few use cases for blockchain and AI. To give you an even better idea of how these two technologies work together, we rounded up a list of 26 companies combining blockchain and AI.\n\n26 Blockchain and AI Examples\nCompanies Using AI and Blockchain\n\nLocation: New York, New York\nCertiK provides tools powered by AI and formal verification to secure blockchain, smart contract and Web3 applications. With its product suite, CertiK technology helps identify security risks, monitor data insights and visualize where crypto funds are going.\n\nLocation: Bellevue, Washington\nCore Scientific integrates personalized blockchain and AI infrastructure with current business networks, upgrading a business’ physical infrastructure, servers and software in the process.\nSpanning across five U.S. states, the Core Scientific facilities are designed for long-term digital asset mining and to maximize hashrate. Because blockchain and AI take up massive amounts of computer processing and power, Core Scientific ensures that company-controlled data centers and blockchain and AI infrastructures always run at optimal efficiency to reduce energy and time consumption.\n\nLocation: Austin, Texas\nToken Metrics is a tool that uses AI to analyze cryptocurrency trends for personal investment purposes. The technology scans the data of over 6,000 crypto and NFT projects and extracts market insights to help users make investment decisions. Token Metrics has been used by companies such as Coinbase, Amazon and Facebook.\n\nLocation: New York, New York\nAI BlockChain hosts a digital asset cloud platform built on blockchain and AI. The company applies artificially intelligent agents to its blockchain to detect changes and ensure platforms are secure. AI Blockchain products aim to be a scalable and tamper-evident database solution for businesses, which can support supply chain, finance and bar code tracking operations.\n\nLocation: Denver, Colorado\nBext360 uses AI and blockchain to boost supply chain transparency and efficiency in the coffee, timber, seafood and mineral industries. The company’s artificial intelligence analyzes crops and predicts growing patterns, while blockchain ensures the recording of a product’s supply chain from seed to finished product.\nThe company’s AI measures the quality of coffee beans and predicts weather and growing patterns, while the blockchain immutably records the farm where the beans originated and the exact specifications of a coffee shipment. It even acts as a payment ledger to ensure that all parties are paid quickly and fairly.\n\nLocation: San Francisco, California\nBlackbird.AI uses its blockchain and artificial intelligence to gauge the credibility of news content in the communications and information industries. To combat misinformation, the company deploys AI to identify network polarization or bot activity, and classify content based on these and other industry credibility indicators. The Blackbird.AI blockchain acts as a ledger that irrefutably stores the verified content created by AI and crowdsourced reports.\n\nLocation: Denver, Colorado\nBurstIQ’s LifeGraph platform combines AI and blockchain technology to provide enhanced ownership and management over patient data. LifeGraph lets healthcare professionals build secure storage solutions for patient’s health records and wellness plans. All applications made through the platform have consent and recovery features built-in, plus are fully HIPAA and GDPR-compliant.\n\nLocation: New York, New York\nChainhaus is a blockchain and AI advisory, education and software development firm. The company provides a variety of end-to-end solutions for everything from teaching and app development to research and capital raising. Chainhaus has partnered with clients such as Accenture, ConsenSys and SAP.\n\nLocation: New York, New York\nCyware Labs incorporates AI and blockchain-based tools into its cybersecurity and threat intelligence solutions. The Cyware Situational Awareness Platform (CSAP), for example, uses those tools to power a mobile threat intelligence, secured messaging and suspicious incident reporting platform. Consequently, users are provided with an in-depth look at their real-time mobile cybersecurity protocols.\n\nLocation: Washington, D.C.\nDobby is a home services platform for homeowners seeking assistance with maintenance or repair projects. Dobby’s app connects users to local partners for roofing, plumbing, landscaping and other general maintenance services where needed. The AI-based application operates on blockchain technology to exchange data quickly and reduce any financial loss.\n\nLocation: San Francisco, California\nFigure uses blockchain and artificial intelligence to streamline the home loan process. Established by former SoFi founder Mike Cagney, the platform offers home equity line of credit loan options, investment marketplaces and its own digital money app called Figure Pay.\n\nLocation: New York, New York\nGainfy is a healthcare platform that employs blockchain, AI and IoT devices to improve the industry experience. Some of the company’s services include machine learning research and development consulting, blockchain design for health record management and the Gainfy Edison platform, which presents AI-backed diagnostic insights for healthcare professionals.\n\nLocation: San Francisco, California\nHannah Systems brings AI and blockchain to autonomous vehicles. The company’s portfolio includes an AI-powered data exchange platform, real-time mapping tool, an insights dashboard and blockchain so an autonomous vehicle can quickly absorb, interpret and safely store data.\nHannah System’s deep learning predicts road information based on human behavior such as jaywalking and speeding, and it takes into account up-to-date weather and traffic congestion notifications.\n\n\nLocation: Nashville, Tennessee\nHashed Health is a venture studio based on blockchain that elevates startups in the healthcare industry. The company provides resources and team guidance to fuel healthcare product life cycles, including those focusing on Web3, AI and healthcare data solutions.\n\nLocation: Orlando, Florida\nHome Lending Pal is an application for home mortgage advising, comparison and more. The AI-based platform allows users to view local homes, calculate personal budgeting and choose their preferred home lender based on related mortgage rates. In addition, Home Lending Pal also stores all user information on the blockchain to ensure data security.\n\nLocation: Raleigh, North Carolina\nImaginovation builds and hosts customer-centric applications for clients in need. The company works with expertise in UI\/UX design as well as web and mobile application development, with the goal of making platforms that are creative and engaging for users. Utilizing solutions from blockchain, AI, IoT, AR and VR, applications can be created for purposes ranging from manufacturing to entertainment.\n\nLocation: San Francisco, California\nLeewayHertz helps businesses create Web3-focused software platforms. The company leverages tools in blockchain, AI and more to create software products harboring the latest in tech for various industries. LeewayHertz services have built software for use from healthcare and education to the metaverse and NFTs.\n\nLocation: San Francisco, California\nMOBS is a blockchain-based video marketplace for the selling and buying of smartphone videos. Once a user puts their video up for sale, potential buyers — say, marketers that need compelling footage — can scroll through the app and find what they need. Mob’s blockchain then creates a smart contract that directly allocates money to the content creator based on engagement rates and views.\n\nLocation: Irvine, California\nNetObjex merges blockchain and AI to host its NFT marketplace platform, where users can create their own marketplaces and digital wallets as well as host metaverse events. Wallets made through the platform are secured through the blockchain, and offer support to buy, sell and swap different cryptocurrencies.\n\nLocation: Salt Lake City, Utah\nNeureal is a prediction engine that combines AI, blockchain and cloud technologies to predict everything from the stock market to Google searches. The company’s AI scans past predictions to predict future occurrences. Additionally, its blockchain ledger logs every outcome so the computer networks can pinpoint trends in correct predictions.\n\nLocation: San Francisco, California\nNumerai is a decentralized hedge fund at which data scientists from all over the world are constantly working on AI problems. Featuring a stock market prediction competition that runs on blockchain, the company gives scientists raw data on machine learning problems, then scientists create models based on the data. The scientists with the best models are rewarded with their own Numeraire (NMR) crypto.\n\nLocation: Berkeley, California\nStowk’s blockchain-based platform, which features AI tools for almost every part of a businesses’ operations, streamlines everything in supply chain management from data access and IT governance to procurement.\n\nLocation: Los Angeles, California\nVerisart uses artificial intelligence and blockchain to help create and certify NFT work in real time. The company’s Web3 tools allow artists to create tamper-proof certificates of work that ensure credit and immutability. The blockchain-backed certificates feature encryption that instantly stop fraudulent copies from being sold as originals.\n\nLocation: Austin, Texas\nVytalyx is a healthtech company using AI to give healthcare professionals blockchain-based access to medical intelligence and insights. By storing medical information on a blockchain, a patient’s medical staff can use AI to personalize treatments and nutrition plans, increase patient\/doctor communication and even search for clinically relevant medical studies almost instantly.\n\nLocation: Chicago, Illinois\nWealthBlock is an automated marketing and messaging SaaS platform for businesses raising capital. Blockchain powers the company’s investor referral and suitability checking process so companies can rest assured they’re working with only high quality partners. Additionally, Wealthblock’s AI automates content and keeps investors continuously engaged.\n\nLocation: West Hollywood, California\nWorkDone helps businesses automate daily processes and discover insights to retain employees. The company specializes in machine learning and blockchain to seek out resource bottlenecks, analyze best management practices and continually maintain service compliance.\n",
        "Ngày tạo": "Feb 24, 2023",
        "Nguồn website": "builtin.com"
    },
    {
        "Loại bài viết": "News Article",
        "Tiêu đề bài viết": "Blockchain in Government: Applications and Examples",
        "Chuyên mục mà bài viết thuộc về": "Blockchain In Government",
        "Hashtag đi kèm": [
            "#Blockchain"
        ],
        "Tên tác giả nếu có": "Sam Daley",
        "Link bài viết": "https:\/\/builtin.com\/blockchain\/blockchain-in-government",
        "Tóm tắt bài viết (nếu có)": "None",
        "Nội dung chi tiết bài viết": "Bitcoin was launched in the wake of the 2008 financial crisis, and in some ways, the decentralized currency reflected the widespread anger people had toward the way financial and political institutions handled the economic fallout. And yet, all these years later, Bitcoin’s underpinning technology, blockchain, is embraced by the very institutions at which its creator lashed out.\nBlockchain in Government Examples\nMany states, nations and government agencies are adopting blockchain technology for everything from improving the voting process to making public services run smoother. The following examples illustrate the potential of blockchain in government.\n\nBlockchain in Public Assistance and Foreign Aid\nNothing seems to be more synonymous with government bureaucracy than public assistance programs and foreign aid. Charities and individuals must go through months, even years, of red tape to prove to obtain critical funding.\nBlockchain-based welfare programs are improving the process by saving governments thousands of hours of time and millions of dollars on inefficient programs.\nForeign aid has always been a bureaucratic nightmare. According to Foreign Policy, some foreign aid workers, in the midst of intense war or famine, must complete hundreds of pages of grant plans, budgets, a 14-point checklist and be approved by third-party financial institutions to even be considered for foreign aid. By the time the financial aid arrives, the circumstances are usually much worse.\nBlockchain’s smart contracts, lack of inefficient third parties and instantaneous cryptocurrency payment methods can help foreign aid become much more impactful.\nHere are a few examples of blockchain in government being used to streamline assistance programs at home and abroad,\n\nLocation: New York, New York\nThe United Nations World Food Program created Building Blocks, a platform using ethereum blockchain to deliver aid. The UN completed its first successful trial when it transferred cryptocurrency-based food vouchers to 10,000 refugees in Pakistan. Since the trial, Building Blocks has transferred $325 million to approximately one million refugees in Bangladesh and Jordan.\n\nLocation: London, England\nThe UK teamed up with GovCoin in order to develop a blockchain for welfare payments. The app is a digital version of a “jam-jar.” Crypto is divided into separate accounts, or “jars,” to cover rent, grocery and utility costs. Besides the efficiency of automatic payments, GovCoin also circumvents banks, which can hold much-needed welfare money for long periods of time.\n\nLocation: Berkeley, California\nAnkr is a cloud-based blockchain infrastructure for businesses. The company has developed a Proof of Useful Work method that lets anyone with idle computers or extra data space to rent out their computing power for data mining. Ankr believes that compensating everyone for using their computers to mine data can lead to a universal basic income, which could supplant a traditional government welfare system.\n\nLocation: Copenhagen, Denmark\nDenmark’s Ministry of Foreign Affairs partnered with virtual currency platform Coinify to use blockchain in foreign aid delivery.\nThe biggest benefit of blockchain for Denmark is the time and money saved by foregoing the involvement of a third-party financial institution. Instead of relying on banks, donors and Denmark’s foreign aid fund can directly send money to groups collecting aid via cryptocurrency.\nMore on BlockchainBlockchain in Music: 17 Examples Reshaping a Changing Industry\n\nBlockchain in Government Smart Contracts\nWe’ve all experienced the headache of red tape, but using blockchain in government may be the answer to ending the public sector’s reliance on paperwork, third parties and physical contracts.\nBlockchain-based smart contracts set parameters that parties must agree upon before executing a transaction, but are only initiated if all pre-negotiated stipulations are met.\nFor example, a local government contracts Acme building company to build a new bridge. Acme charges the government $1,000 for their services. In order to execute the contract, the blockchain’s decentralized nodes will have to unanimously agree that the government has $1,000 to spend, and secondly the government owns the land on which they want the bridge built and finally that the Acme company is legally allowed to construct bridges. Once all criteria are met, the contract will immediately initiate the project.\nDuring the project any violation of contractually agreed upon parameters can be enforced in real-time as opposed to after the fact. Without relying on middlemen like lawyers, smart contracts save time and money, as well as establish trust between parties.\nSmart contracts aren’t just for municipal infrastructure projects. According to a study by the U.S. Department of Transportation, seven out of 10 government executives believe blockchain will have a disruptive impact on major public and private sector contracts.\nEverything from billion dollar defense contracts to the purchase of public lands could eventually be “smart.” By cutting out middlemen, government agencies can potentially save thousands of hours of paperwork and millions of dollars in redundant fees — and it’s already happening.\nWe’ve rounded up a few examples of governments and government agencies exploring or implementing blockchain-based smart contracts.\n\nLocation: Washington, D.C.\nUnder its Government IT Initiatives program, the US General Services Administration is looking into adopting ledger systems, like blockchain, into everyday federal government use. The agency held the U.S. Federal Blockchain Forum in 2017 and is looking into using smart contracts for patents, trademarks, IT purposes and foreign aid delivery.\n\nLocation: Nashville, Tennessee\nIn March 2018, the State of Tennessee unanimously passed Senate Bill 1662, which recognizes the legality of blockchain-based smart contracts. In the bill, the state grants legal authority to those using smart contracts when conducting electronic transactions, protecting ownership rights and securing certain private information. The law is an example of positive blockchain implementation that other states, federal government and even law school programs have modeled since its introduction.\n\nLocation: United Arab Emirates\nKnown as the “city of the future”, Dubai moved its judicial system to function on blockchain technology. Coined the “Court of Blockchain,” the network uses smart contracts to improve Dubai’s legal system. Officials believe running on a secure, efficient and transparent blockchain will save the city over 25 million man hours and $1.5 billion annually.\nBlockchain in Healthcare\nBlockchain is used across the healthcare industry in a variety of ways, from securing patient medical records to managing pharmaceutical supply chains.\nBlockchain may also be able to save lives. In 2016, research from John Hopkins University revealed that the third leading cause of death in the U.S. were based on medical errors. These errors were the result of poorly coordinated care like missing information on patient records or incomplete care tasks.\nBlockchain can solve issues within healthcare by linking medical record systems to secure software — creating a single view of a patient’s record without putting patient data at risk on the blockchain.\nHere are a few examples of how blockchain is being used to provide secure and safe healthcare.\n\nLocation: New York, New York\nCoral Health uses blockchain ledgers to connect doctors, laboratories and public health authorities. The company also utilizes smart contracts to speed up administrative processes and ensure patient information and treatment plans are accurate. Coral Health’s use of blockchain to accelerate the care process can lead to quicker, safer treatment and improved health outcomes.\n\nLocation: Lausanne, Switzerland\nEstonia and the United Arab Emirates have used Guardtime to implement in their healthcare and cybersecurity systems. The company also created VaccineGuard, a digital platform connecting vaccine distributors, manufacturers and hospitals. The platform can provide counterfeit vaccine detection by using blockchain to allow easy and secure data sharing between participants.\n\nLocation: Denver, Colorado\nBurstIQ is a platform that manages large datasets of patient information. In compliance with HIPAA regulations, the company uses blockchain to enable the safekeeping, sale, sharing or licensing of data. BurstIQ’s platform also offers accurate, up-to-date information on patient’s health and healthcare activity.\nRead NextBlockchain in Healthcare: 17 Examples to Know\n\nPublic and Private Record Keeping on Blockchain\nFederal and state governments have trillions of tax, identification, real estate contracts, birth and death certificates that must be accounted for at all times, along with trillions of archived public documents that must be maintained. Many organizations looking for a way to secure and organize those documents see great promise in blockchain.\nIn 2022, Shields Health Care Group, a Massachusetts healthcare provider, experienced a data breach that exposed the information of approximately two million people. The breach resulted in stolen identities, billing information and medical records.Identity thieves prey on the vulnerability of government and big bank computers to gain access to passport, social security and banking information.\nA simple malicious email to an unsuspecting employee can expose thousands, if not millions, of U.S. citizens to identity fraud. Using blockchain in government has the ability to stop hackers in their tracks through safe identity encryption.\nBlockchain’s private encryption combined with unique cryptographic identifiers can allow any government employee or individual to safely and quickly find the proverbial needle in a haystack of information. The following are a few examples of how blockchain is revolutionizing government record keeping.\n\nLocation: Springfield, Illinois\nThe Illinois Blockchain Initiative is seen as one of the leading U.S. entities seriously exploring blockchain technology in government. The state-funded initiative is looking into different ways to use the ledger to maintain the data integrity of passports, birth certificates, death certificates, as well as voter registration and social security information. Illinois officials believe blockchain is not only a safer option to store this important data, but a more efficient option as well.\n\nLocation: Dover, Delaware\nThe Delaware Blockchain Initiative has explored blockchain in both public record organization and private sector data security. The initiative has mostly focused its efforts on archiving public documents like historical records and laws, but since Delaware is home to roughly 65 percent of all Fortune 500 companies, the state is looking into how to protect the financial information of the companies and their shareholders using encrypted ledgers.\n\nLocation: Canberra, Australia\nAustralia teamed up with IBM to make the Land Down Under one of the top countries in the world integrating blockchain into its record keeping process. The country is using the technology to combine its passport and birth certificate databases into one blockchain-backed base. Both IBM and government officials believe blockchain brings a heightened level of data integrity and security to record keeping.\nGo Deeper on BlockchainAdvantages of Blockchain: 8 Worth Considering\n\nBlockchain in Law Enforcement\nFrom maintaining data integrity to discovering crimes faster, blockchain has myriad uses in law enforcement. According to law enforcement veteran and cybercrime investigator Paul Marrinan, blockchain makes records immutable, can track criminals attempting to use false identities and enables secure information sharing.\nThe greatest attribute blockchain brings to policing is chain of evidence. In a chain of evidence, blockchain records every event and detail (police body cam footage, arrest data, police reporting, etc.) in sequential order with timestamps, creating a detailed timeline of events. Because the data is irrefutable, investigators and court systems can use it to piece together legitimate evidence for trial.\nAuthorities can also use the chain of evidence for easier detection of crimes, especially in the financial sector. If a criminal is trying to use a false identity or access unauthorized financial information, the blockchain will immediately recognize this action as malicious, alerting authorities.\nHere are a couple notable examples of how blockchain is taking hold in law enforcement.\n\nLocation: San Francisco, California\nChronicled builds blockchain-based networks that feature a transparent chain of custody that allows permissible parties to view information.\nLaw enforcement officials can use the company’s blockchain ledger to view any suspicious activity, like drug trafficking. Additionally, Chronicled has developed tamper-proof shipping containers that register and track all contents throughout the shipping process, making it simple for law enforcement to use as evidence.\n\nLocation: London, England\nElliptic creates blockchain-based forensic investigation tools used by law enforcement, financial institutions and intelligence agencies. The company’s technology allows authorities to scan cryptocurrency exchanges for illicit relationships and transactions. Elliptic’s tools have helped law enforcement spot drug trafficking, extortion, tax evasion and even attempted terrorism.\n",
        "Ngày tạo": "Sep 15, 2022",
        "Nguồn website": "builtin.com"
    },
    {
        "Loại bài viết": "Blog Post",
        "Tiêu đề bài viết": "Smart Contracts in Blockchain: What They Are, How They Work",
        "Chuyên mục mà bài viết thuộc về": "Smart Contracts Blockchain",
        "Hashtag đi kèm": [
            "#Blockchain",
            "#Finance",
            "#Fintech"
        ],
        "Tên tác giả nếu có": "Lisa Bertagnoli",
        "Link bài viết": "https:\/\/builtin.com\/blockchain\/smart-contracts-blockchain",
        "Tóm tắt bài viết (nếu có)": "None",
        "Nội dung chi tiết bài viết": "Chances are good you’ve used a vending machine. You choose your item, then feed enough money into the machine to pay for it. The machine verifies that it’s the correct amount, then fetches and dispenses your item. You get said item only if you’ve fed the machine the right amount of money.\nSmart contracts aren’t all that different.\nWhat Is a Smart Contract?\nSmart contracts provide a way to transact business on blockchains. They are digital documents that make NFTs, crypto trading and many more Web3 tasks possible. And they have plenty of benefits, including transparency and immutability, and quite a few challenges, including transparency and immutability.\nMore on Blockchain Innovation50 Blockchain Companies Paving the Way for the Future\n\nWhat’s a Smart Contract in Blockchain?\n“A smart contract is a program that runs on a blockchain that enables the conversion of traditional contracts into digital counterparts. Like crypto wallets, smart contracts have a balance and can send transactions over the network.\nThe difference is that once deployed, smart contracts run as programmed. Like a standard contract, smart contracts can establish rules and then have the system automatically enforce those rules through code. Smart contract interactions are irreversible by default and cannot be undone.”\nAdam Adler supplied that description and passed along the vending-machine analogy. “With both a vending machine and smart contracts, a specific input guarantees predetermined outputs,” said Adler, co-founder and head of creative at Myntr, a New York-based NFT and digital agency. The analogy and the term “smart contract” are both attributable to computer scientist Nick Szabo, Adler said.\nSmart Contract Terms to Know\n\nSmart contracts are usually associated with NFTs, or non-fungible tokens. That’s hardly their only application, though, for instance, any kind of transaction that would be handled via a paper contract can be handled via a smart contract. “The applications are nearly endless,” said Alex Wykoff, director of product at Wursta, a tech consultancy based in Austin, Texas.\nHere are a few examples:\nTerms of these contracts are set in stone, meaning neither party can back out or fiddle with the price. While smart contracts do entail fees (charged for the computing power of the blockchain), they can be less expensive to execute because there’s no middle party (for instance an attorney or a centralized financial institution).\nSmart contracts can be set up to trigger and resolve a claim right after an accident occurs. This cuts the considerable red tape and back-and-forth that an accident claim can generate, according to blog 101 Blockchains.\nGaming NFTs have risen in popularity as a way to buy in-game purchases, sell them to other players, or even move them to other supported games, said Wykoff. “The unique ability for NFTs to retain value beyond a single game gives the limitless potential for new experiences within gaming,” he said.\nHome Depot has used smart contracts to resolve vendor disputes since 2018, Adler said. “The transparency of smart contracts allows retailers and suppliers to communicate and address issues in real time,” he said.\nSmart contracts could shake up the live-event ticketing industry. Case in point: Ticketmaster’s vice president of blockchain products Sandy Khaund signaled the company’s interest in pursuing smart contract technology to make its ticketing processes smoother and more secure.\nMore on Smart Contract Applications8 Crypto Loan Companies Using Blockchain for Lending\n\nHow Do Smart Contracts Work?\nSmart contracts run autonomously. They require no need for manipulation by humans, as is the case with paper contracts. There are no intermediaries, and trust is not a requirement because the blockchain automatically executes the contract once terms are met. “In a non-smart contract, even if the conditions are met, one still needs to trust another party to honor the agreement,” Adler said.\nSmart contracts run on if-then conditional arguments written in code, he explained. A network of computers continuously monitors when rules are met and verified and, in turn, executes predetermined actions, for instance buying digital assets or exchanging currency.\n\nHow to Create a Smart Contract\nThe process involved in writing and creating smart contracts can be broken down into seven steps, said Weijia Zhang, co-chair of the cross-chain interoperability working group for the Ethereum Enterprise Alliance, a Wakefield, Massachusetts-based group that promotes the use of Enterprise Ethereum and Mainnet Ethereum.\n\nBefore wading into smart-contract territory, you need a basic understanding of how blockchains work. You also need to know why you’re using blockchain to solve a particular problem in the first place, Zhang said.\n\nSolidity is the leading programming language used to write smart contracts on various blockchains — most notably Ethereum, the most widely used blockchain for smart contracts, Zhang said. Its syntax is similar to JavaScript, and thus will look familiar to coders who know scripting languages. Writing smart contracts in Solidity is necessary to run smart contracts on the Ethereum Virtual Machine, a virtual environment baked into Ethereum and other blockchains that functions as a virtual computer system, Zhang explained.\n\nSolidity, a powerful programming language, can be used to build just about any application a developer can dream up, Zhang said. Because of this, smart contracts can be extremely complex. For more complex smart contracts, the actors, roles, access privilege for each function should be defined and implemented, he said.\n\nEthereum isn’t the only blockchain that has smart contracts. Avalanche, Polygon, Wanchain and others also support Solidity smart contracts. Research each to understand their pros and cons, and choose a blockchain on which to deploy your smart contract.\n\nDeploying smart contracts on a blockchain is not free. Every blockchain charges “gas” fees to issue smart contracts that must be paid in the blockchain’s native token. Ethereum, for example, makes users pay for “gas” using ETH; similarly, Wanchain makes users pay for “gas” using WAN. The more complicated the contract, the higher the “gas” fees, Zhang said.\n\nTruffle and Remix, which are integrated development environments, are popular tools for deploying smart contracts, Zhang said. These tools consolidate all the parts of smart contracts into a single graphical user interface, or GUI. They include debuggers and editors plugins.\n\nEach smart contract has a unique address on the blockchain that is generated when the smart contract is deployed. Find it, save it, and send it to the other parties so they have access to your smart contract. Take care when saving your smart contract’s address. If you send tokens to the wrong address, you could lose access to your assets. “This is very important,” Zhang said. Without the correct address, you can’t access your smart contract or its functions.\n\nWhen learning Solidity, it’s better to start with simple smart contracts like the following HelloWorld smart contract: HelloWorld.sol, said Zhang of the Ethereum Enterprise Alliance.\nHere’s what it looks like:\nThe source code, Zhang explained, begins with comments that describe what the smart contract is about, before introducing specific functions. The functions themselves are also simple. The first function, justHelloWorld(), outputs a string “HelloWorld”. The second function takes an input variable of me and then outputs “HelloWorld from [me]”. This simple smart contract can be compiled, deployed, and executed on a blockchain.\nWant to see more examples? JB Larson, a digital marketer at Gillware, a data recovery company based in Madison, Wisconsin, provided two examples from his Github page. One’s a practice contract and the other is an escrow contract.\n\nBenefits of Smart Contracts\nThey have many, including immutability and transparency (both of which can also be drawbacks) and security.\n\n“The major benefit of smart contracts is their capacity to execute clearly defined programmatic logic with a miniscule chance of bad actors tampering with the program,” said Larson. Once a Solidity smart contract is live in the Ethereum Virtual Machine \/ Ethereum blockchain, there is no way to change it, he said.\n\nHow many times have you heard “you need to wait X business days” for a paper contract to be completed? That’s not the case with smart contracts, as they live in a place where there’s no such thing as business days, said Pavel Tantsiura, CEO of The App Solutions Company, based in Delaware.\n\nSmart contracts live on the open decentralized ledger that is blockchain, and are visible to all people who have access to that blockchain. That means it’s tough to conceal private (or even shady) deals from prying eyes.\n\nOnce the terms of a smart contract are set, that’s it. “They can’t be interfered with by humans once they are set in motion,” said Dan Hollings, co-author of One Coin, Two Coin, What Coin? Bitcoin: Crypto for Grownups Made as Easy as Child’s Play. Take the purchase of a car, for instance. If the transaction were set up as a smart contract, the buyer wouldn’t have to worry about the seller backing out of the deal or jacking up the price.\n\nChallenges of Smart Contracts\nSmart contracts are immutable, so a small slip in the code can result in enormous and negative consequences. “I would strongly encourage new developers to stay on testnets until they feel very comfortable with the smart contracts they are creating,” said Wykoff of Wursta. He’d also advise everyone to use hardware or a cold-storage wallet, which stores private keys offline and helps keep smart contracts (and cryptocurrency) more secure.\n“The blockchain is global, but laws and regulations are still regional.”\nFinally, “be aware of the regulatory environments you may find yourself or your users in,” Wykoff said, noting recent U.S. Treasury sanctions of a well-known cryptocurrency mixer. “The blockchain is global, but laws and regulations are still regional,” he said.\nHere are a few more smart-contract challenges.\n\nCorrectly coded smart contracts are fine in their immutability; those that are incorrectly coded can cause headaches. “If there is a flaw in the code that can be exploited, then the contract can be hacked and some or even all of the funds can be drained,” Hollings said.\n\nSmart contracts are visible to everyone on the blockchain on which they reside. Bugs, security holes and other vulnerabilities roll out the welcome mat for hackers, said Tantsiura of the App Solutions Company. That lack of privacy also makes smart contracts less than ideal for discreet transactions, for instance the purchase of art by a buyer who’d just as soon remain anonymous.\n\nSophisticated coding knowledge is necessary to write and read a smart contract. That means that most attorneys are not able to read them. And smart contracts, like paper contracts, must adhere to local laws. “That can get tricky when you’re trying to comply with housing laws and such,” said Guy Gotslak, president and founder of Los Angeles-based crypto exchange My Digital Money.\nEven so, “protecting consumers is actually easier with blockchain technology because it’s more efficient, it’s all trackable and transparent,” Gotslak said. “We just need to figure out the security aspects.”\n\nSmart contracts, with very few exceptions, are meant to be written and deployed once. That makes them tricky for complicated situations, where conditions are still being debated or are subject to change, Wykoff said. In those instances, “perhaps you should consider an off-chain solution,” he said.\n\nJust like you need to pay an attorney or third party to write a paper contract, you have to pay to execute a smart contract on a blockchain. Fees (called “gas” in Ethereum) can add up, especially if the value of the token soars during the operation.\n\nAnalog contracts remain the standard in transactions; smart contracts are not used by everyone, everywhere, said Brian Platz, CEO and founder of Fluree, a North Carolina-based Web3 data platform. “Hurdles come with implementing this new technology, including issues concerning programming language as well as companies and industries that may hold out on adopting it,” Platz said.\nWhile slow or small-scale adoption could make the technology less effective and useful to the large pool of people who can benefit from it, smart contracts will become more commonplace with time and the increased efficiency of smart contracts, he added.\nBlockchain Platforms to Know20 Blockchain Platforms Driving the Industry\n\nThe Bottom Line on Smart Contracts\nGiven the relative newness of blockchains, smart contracts are remarkably stable, said Zhang of the Ethereum Enterprise Alliance.\n“We have not seen issues with smart contracts where it’s the blockchain itself that actually breaks down,” Zhang said. Solidity, for example, is in v0.8.16. “It’s not even v1 yet,” Zhang said. “As with every new technology, there are some risks.” But, he added, “people are aware of the risks and the development community has been making steady progress.”\n“We have not seen issues with smart contracts where it’s the blockchain itself that actually breaks down ... It’s the people who write smart contracts.”\nThe biggest challenge isn’t the language, or EVM, or blockchains, Zhang said. “It’s the people who write smart contracts,” he said. A bug on just one line of code can damage the platform and spark the loss of millions of dollars. Complex smart contracts, he explained, require hundreds of lines of codes. In contrast, simple smart contracts, like those used to create basic NFTs, can be deployed with only 10 lines of code and an import function.\nThe takeaway? Smart contracts, as with so many things Web3, are a work in progress.\n",
        "Ngày tạo": "Sep 28, 2022",
        "Nguồn website": "builtin.com"
    },
    {
        "Loại bài viết": "News Article",
        "Tiêu đề bài viết": "Bitcoin: Fundamental Technical Structure",
        "Chuyên mục mà bài viết thuộc về": "Bitcoin Work Blockchain Halving",
        "Hashtag đi kèm": [
            "None"
        ],
        "Tên tác giả nếu có": "Cameron and Tyler Winklevoss, Co-Founders, Gemini",
        "Link bài viết": "https:\/\/www.gemini.com\/cryptopedia\/how-does-bitcoin-work-blockchain-halving#section-the-blockchain-ledger",
        "Tóm tắt bài viết (nếu có)": "The Bitcoin network is a decentralized, trustless, peer-to-peer network designed to securely send monetary value from one party to another in the form of bitcoin. This article provides an overview of Bitcoin’s technical structure including the blockchain, nodes, miners, and proof of work mining. If you’d like to read up on other aspects of Bitcoin, be sure to check out our other articles, including Bitcoin: Origins and Cultural Significance Bitcoin: Origins and Cultural Significance and Bitcoin: Network Security Bitcoin: Network Security .",
        "Nội dung chi tiết bài viết": "The Blockchain Ledger\nThe Bitcoin network maintains a distributed public ledger that records the ownership of all bitcoin, the native digital asset token of the network. New transactions are grouped together into “blocks” and added sequentially to the network’s ongoing chain of blocks — hence the term “blockchain.” The Bitcoin blockchain contains every block since inception, stretching all the way back to the first block known as the “Genesis Block.”\nIdentical copies of the blockchain are hosted on computers around the world that run the Bitcoin software. These computers are called \"nodes.\" This design ensures that no single entity is in control of the blockchain or protocol that governs it. Bitcoin's distributed nature makes it decentralized and resistant to being controlled (or shut down) by any government or central authority. Theoretically, all nodes that maintain a complete copy of the blockchain — known as \"fullnodes\" — would need to be destroyed in order to erase the Bitcoin blockchain. No small task as there are even full nodes floating above the earth in space!\nNodes known as “miners” serve the purpose of validating Bitcoin transactions and securing the blockchain ledger. In the traditional banking system, when you send money from your bank account to another bank account, the banks act as trusted intermediaries, deducting funds from one account and adding them to another. With Bitcoin, centralized intermediaries are replaced by a trustless network of miners. We’ll explain how this works shortly.\nPeer-to-Peer Network Nodes\nNodes are a major part of blockchain-based protocols and the cornerstone of decentralization, security, and transparency. There are several types of nodes on the Bitcoin network. When a user connects to the Bitcoin network to send or receive bitcoin, her computer acts as a node. Most nodes are known as light nodes, which typically only download the more recent blockchain data needed to process and verify new transactions. This minimal approach keeps light nodes running quickly and efficiently without requiring too much computational or storage resources.\nIn contrast, full nodes contain an entire copy of the blockchain in real time. They download every block of transactions that has ever happened on the network since the Genesis Block — not just the most recent ones. As long as the full blockchain exists on at least one full node, there will be a record of all bitcoin and bitcoin transactions throughout history.\nFinally, there are the nodes called miners who write blocks of new transactions to the blockchain and, in doing so, mint new bitcoin.\nProof-of-Work Mining: Bitcoin’s Consensus Mechanism\nMiners compete to solve a computationally-intensive, proof of work puzzle. The “winning” miner is rewarded with a set number of bitcoin (plus network transaction fees) called the “block reward.” One miner wins the block reward roughly every 10 minutes, regardless of the amount of processing power that miners collectively bring to bear on the network. More processing power only increases a miner's chances of winning; it does not speed up the competition. Miners can’t accelerate or otherwise alter Bitcoin’s deterministic supply schedule.\nThe puzzle requires a miner to create a new block by taking all of the network’s new and unconfirmed transactions, as well as information from the previous block (i.e., its “block header”), and “hash” them using the SHA-256 algorithm. Hashing is a process whereby a specific input (in this case, recent transaction data and the block header) is entered into an algorithm to generate a specific output. A Miner must take this input and guess a number called a “nonce” that when entered together into SHA-256, will generate an output that satisfies the output threshold set by the Bitcoin protocol. Mining boils down to guessing nonces as quickly as possible. If a miner hits the specified output threshold, she will broadcast her new block (which includes her nonce) to other miners on the network so that they can hash it themselves and verify her solution. If a majority of miners — 51% or more — reach consensus on her solution, she will be allowed to add her new block to the blockchain and receive the block reward. And then the race begins all over again.\nHere’s the important part: if any of the transaction data is altered by even the smallest amount (say a “satoshi,” which is 0.00000001 BTC), the hash output will change. As a result, a majority of miners will fail to reach consensus around any nonce that solves the puzzle using tampered transaction data. This prevents a dishonest miner from winning and encourages miners to act scrupulously with their precious computational resources.\nBitcoin mining is an elegant design that serves the dual purpose of validating transactions and minting new bitcoin. But there’s more...because mining requires computer processing power (i.e, energy), there is a real cost to minting bitcoin, which gives it digital scarcity. This mimics real world gold production inasmuch as they both require energy to mine. But unlike Bitcoin, gold mining does not serve to validate (and process) transactions. Bitcoin mining does both, and that’s a beautiful thing.\nAnatomy of a Block\nEach Bitcoin block is limited in size to one megabyte of data. For “Segregated Witness” (SegWit) blocks, transaction data is limited to one megabyte, whereas signature data (aka witness) is segregated and limited to three megabytes. This keeps the block size at one megabyte while increasing block space for transaction data.\nA block contains the following information:\nA Block header:\nVersion number\nHash of the previous block header\nHash of the root of Merkle tree of all the transactions in the current block\nTimestamp\nDifficulty target of the current block (meaning how difficult the target hash will be to find)\nNonce\nData for each transaction:\nVersion number\nFlag (only for SegWit transactions)\nTransaction inputs\nTransaction outputs\nWitnesses (only for SegWit transactions)\nLock time\nBitcoin Halving\nBitcoin has a deterministic supply schedule that caps the total supply of bitcoin at 21 million bitcoin (or BTC). As discussed above, new bitcoin are minted when a miner wins the block reward. The block reward amount is “halved” every 210,000 blocks, which happens approximately every four years. Bitcoin’s halving schedule is as follows:\n2009 to 2012: block reward = 50 BTC\n2012 to 2016: block reward = 25 BTC\n2016 to 2020: block reward = 12.5 BTC\n2020 to 2024: block reward = 6.25 BTC\nThe next halving will occur in early 2024, when the block reward halves to 3.125 BTC. As the block reward continues to halve, it will eventually approach zero — approximately in the year 2140. In other words, after 2140, no new bitcoin will ever be minted and the block reward will consist solely of transaction fees charged by miners when bitcoin is sent on the network.\nThe fixed and predetermined supply schedule of bitcoin gives it “hard money,” store of value properties and is why many people consider it “digital gold” or “gold 2.0.”\nBitcoin Forks\nA fork occurs when an existing blockchain splits into two different blockchains. This happens when an update is made to a protocol that not all of the nodes adopt. There are two types of forks that blockchains can experience; a soft fork, whereby old nodes and new nodes are able to read both blockchains (compatible); and a hard fork, whereby old nodes cannot read the new blockchain and vice versa (incompatible). Hard forks result in two separate blockchains with distinct native digital asset tokens that are separate and apart from each other.\nWhen updates are made to the Bitcoin protocol, individual nodes must determine if they will upgrade and accept the new changes or not. If a constituent of nodes within the network refuses to adopt the changes, then a hard fork results. Bitcoin has experienced several forks of both kinds, including the Bitcoin Cash hard fork that occurred at block 661,647, the last common block between Bitcoin and Bitcoin Cash. The Bitcoin Cash fork emanated from a disagreement in the Bitcoin community around block size. Bitcoin Cash adopted a block size of eight megabytes to increase transaction throughput, whereas Bitcoin kept a block size of one megabyte to foster greater node participation and ensure decentralization.\n",
        "Ngày tạo": "November 2, 2023",
        "Nguồn website": "gemini.com"
    },
    {
        "Loại bài viết": "News Article",
        "Tiêu đề bài viết": "What are NFTs (Non-Fungible Tokens)?",
        "Chuyên mục mà bài viết thuộc về": "Nft Non Fungible Token Crypto Collectibles",
        "Hashtag đi kèm": [
            "None"
        ],
        "Tên tác giả nếu có": "Cryptopedia Staff",
        "Link bài viết": "https:\/\/www.gemini.com\/cryptopedia\/nft-non-fungible-token-crypto-collectibles#section-nft-101-non-fungible-tokens-explained",
        "Tóm tắt bài viết (nếu có)": "A non-fungible token (NFT) is a cryptocurrency token that is indivisible and unique. One NFT cannot be interchanged with another NFT, and the whole cannot be broken down into smaller parts and used. NFTs offer a myriad of options for creating and trading digital assets — such as original artwork and blockchain-integrated collectible games like CryptoKitties . NFTs are useful for proving the scarcity and provenance of rare assets, both digital and in the real-world. Non-fungible tokens are mainly built on Ethereum using the ERC-721 token standard.  Check out Nifty Gateway to learn more",
        "Nội dung chi tiết bài viết": "NFT 101: Non-Fungible Tokens Explained\nAn NFT (Non-Fungible Token) is a unique digital asset stored on a blockchain, representing ownership or authenticity of specific digital content, like art or collectibles.\nCreate an NFT by choosing a blockchain, setting up a digital wallet, using an NFT marketplace to mint your digital content, paying minting fees, and listing it for sale.\nNFT art refers to digital artwork tokenized as NFTs, allowing artists to sell and authenticate their digital creations in the form of unique tokens.\nBuy NFTs on Nifty Gateway using a compatible digital wallet and cryptocurrency (usually Ether for Ethereum-based NFTs).\nWhat is a Fungible and Non-Fungible token?\nA fungible asset refers to an asset that is interchangeable with any other like unit of that asset. For example, one bitcoin (BTC) is the same as any other bitcoin in circulation — the case is the same with dollars or euros or ether (ETH). Fungible assets are also divisible, meaning they can be fractionally broken up into smaller units that share the same properties. Fungible assets are essentially indistinguishable from one other. These traits are key for any asset to be viable as a payment mechanism. On the other hand, non-fungible tokens are crypto tokens that are indivisible and unique. While NFTs are built on smart contracts just like ETH and DAI, NFT contracts contain specific information that makes each NFT different from the next. In this way, one NFT cannot be interchanged with another NFT, and the whole cannot be broken down into smaller units and used. These traits denote non-fungibility, hence the name NFT.\nAre NFTs Rare and Unique?\nNFTs are provably scarce assets. Each non-fungible token contains computerized code that verifies it is the only asset with its specific digital identity. This all-important characteristic is useful for creating unique digital goods, and can even be used to represent rare physical assets, whose provenance (historical record of ownership) can be tracked and cryptographically verified through its underlying blockchain protocol. The possibilities for exclusive and rare items that can be traded — such as digital art, collectibles, or game pieces — are endless. Platforms like Nifty Gateway bring NFTs to an ever-growing consumer base.\nWhy is Ethereum so popular for NFTs?\nEthereum is the most popular blockchain for creating NFTs today, as most NFTs are typically built with the ERC-721 token standard. This standard outlines a minimum set of features that each non-fungible token should possess, but it does not limit potential extra attributes of NFTs.\nEthereum is widely used to mint NFTs because of its smart contract capabilities and interoperability with other blockchains. Smart contracts are self-executing contracts with the terms of the agreement (between buyer and seller) directly written into code. This allows developers to create custom NFT standards and functionality, making Ethereum a flexible platform for NFT creation.\nHow are NFTs Used? Use cases for NFTs\nCreating digital or crypto-collectibles\nManaging ownership of digital items within blockchain-integrated games\nProving authenticity of digital art, while allowing artists to retain their copyright and intellectual property\nDevising a digital identity system that allows users to control their data from one place\nAllowing fractional ownership of high-value items, such as real estate\nOne of the earliest and most popular applications for NFTs is the Ethereum-based game CryptoKitties, which allows players to buy, sell, and breed digital cats. CryptoKitties launched on November 28, 2017 and within two weeks had more than 150,000 users and $15 million in transactions. A single CryptoKitty was sold for $170,000, which made the platform a viral sensation, attracting a new audience of gamers to Ethereum along with global mainstream attention.\nCryptoKitties was successful, but that success led to serious transaction congestion on the Ethereum network. The resulting scramble to accommodate network scalability — plus the large amounts of capital being exchanged for digital cats — drove many news organizations to cover CryptoKitties. This brought significant awareness to blockchain as a technology that can offer more than just cryptocurrencies.\nWhat is the future of NFTs?\nSince then, NFT gaming has grown tremendously. Dapper Labs, the company behind CryptoKitties, began partnering with other NFT providers in January 2019 to allow interoperability between game platforms. This means that a native NFT from one platform can now be utilized in another. A number of mainstream organizations have developed NFT projects — such as NBA Top Shot, created by game developer Ubisoft and the National Basketball Association (NBA).\nThe potential for NFTs has expanded significantly beyond gaming. Businesses and blockchain projects are exploring how to use non-fungible tokens for identifying, certifying, and ticketing, and for granting fractional ownership of both digital and real-world items. NFT use cases can include any instance where there is a need for clear ownership and traceability.\nWhile NFTs still face challenges with regard to interoperability and scalability, the technology has shown its utility in proving uniqueness, scarcity, and ownership for both digital and real-world assets. Already a staple in blockchain gaming and collectibles, NFT technology has proved to be a large growth sector of the blockchain industry as use cases expand into digital identity records and representation of scarce real-world assets.\n",
        "Ngày tạo": "March 7, 2024",
        "Nguồn website": "gemini.com"
    },
    {
        "Loại bài viết": "News Article",
        "Tiêu đề bài viết": "Blockchain Applications in IoT",
        "Chuyên mục mà bài viết thuộc về": "Blockchain Applications In Iot",
        "Hashtag đi kèm": [
            "#Blockchain"
        ],
        "Tên tác giả nếu có": "James Schaefer",
        "Link bài viết": "https:\/\/www.iotforall.com\/blockchain-applications-in-iot",
        "Tóm tắt bài viết (nếu có)": "None",
        "Nội dung chi tiết bài viết": "There's plenty of buzz around the possibility of blockchain applications in IoT. Although they may share a bright future, we need to address problems of longevity and security in blockchain itself.\nBlockchain is no longer in its infancy, but it’s still very new. Similar statements can be made about the Internet of Things (IoT). The buzz around blockchain applications in IoT, however, is far more recent. The union of the two verges on the untested—and currently, the unapplied.\nDespite the fog of confusion and misinformation around blockchain, it has exciting potential applications in IoT. Ranging from secure device communication (and device identity validation) to distributed data creation and automated data selling, blockchain applications in IoT have many possible benefits. The keyword here, however, is possible.\nMany if not all of these applications have yet to make it out of a pilot test—or even a laboratory setting. Some roadblocks remain before blockchain applications in IoT can become a scalable standard.\nIoT Longevity and Blockchain Volatility\nThe first of these challenges is longevity. Many IoT sensors are designed to be operational in the field for years. Some last for a decade. On the other side is blockchain, whose overall market environment is still highly volatile.\nAn IoT solution requires reliability, scalability, and endurance to succeed. And we know IoT works. Blockchain, on the other hand, is a much more experimental and episodic technology. It’s essentially unproven. Blockchain flares up but then drops off a cliff while IoT solutions, once deployed, are used for years.\nAssuming we resolve the underlying tension between the two verticals—and provided we decide to unite blockchain and IoT—we run into another problem. The pre-existing blockchains and their associated host companies are volatile, tied to speculation, and untested. When weighing the risk, you need to look no further than this article on how 46 percent of all initial Coin Offerings (ICOs) have already failed.\nSo we’re left with the solution of building our own, which can be costly and prohibitively time-consuming. On the cost side, now seems like the time to mention the Hyperledger Fabric Project: an open-source, blockchain-based project from IBM Digital Asset. Hyperledger is configurable and relatively simple to get started with. It’s probably one of the best ways to build a blockchain application on your own.\nEven with Hyperledger, building your own blockchain is no easy task. You’ll have to find engineers who are experts on both blockchain and IoT so that they can make intelligent decisions about the entanglement of the two.\nA Gap in the Chain: Human Error & Security Issues\nThe second challenge is security. “Poor security” may sound like a counter-intuitive drawback, since blockchain is supposed to solve all of your security issues. But a blockchain is only as secure as its cryptography. Unfortunately, it’s still people writing the code, and engineers mess up sometimes.\nTake Iota, the prime example of ‘blockchain’ meshed with IoT. (I say “blockchain” in quotes because really Iota uses directed asymmetric graphs). With a market capitalization hovering around $1.5 billion, it would be easy to assume that Iota is free from bugs, security holes, and crazy code. That assumption would be wrong.\nThe Iota affair has been hashed out all over the internet. Here’s the shortened version. Iota did the one thing you should never do in computer security. They rolled their own crypto, which opened them up to a set of collision attacks that let people steal or give away Iota to people illicitly. Additionally, the system itself is based on a ternary rather than a binary system, which slows down their code and makes normal cryptographic functions harder to use. If you can’t trust the poster child of blockchain and IoT, who can you trust?\nFuture Blockchain Applications in IoT\nWhile blockchain certainly has some obstacles to overcome, the truth is the future of blockchain applications in IoT is exceptionally bright. IDC estimates that by 2019 as much as 20 percent of IoT deployments will include blockchain technology. There are also promising avenues in using blockchain to enhance supply chain transparency. But before we get there, we must pose some basic questions about longevity, security, and implementation. And we need answers to ensure that those “20 percent of deployments” are as successful, efficient, and secure as possible.\n",
        "Ngày tạo": "February 8, 2019",
        "Nguồn website": "iotforall.com"
    }
]